alibaba/AliOS-Things/platform/mcu/rtl8710bn/sdk/component/soc/realtek/8195a/fwlib/src/hal_i2c.c
/*
 *  Routines to access hardware
 *
 *  Copyright (c) 2013 Realtek Semiconductor Corp.
 *
 *  This module is a confidential and proprietary property of RealTek and
 *  possession or use of this module requires written permission of RealTek.
 */

#include "rtl8195a.h"
#include <osdep_api.h>
#include "hal_i2c.h"

//---------------------------------------------------------------------------------------------------
//External functions
//---------------------------------------------------------------------------------------------------
extern HAL_TIMER_OP HalTimerOp;

#define I2C_STATIC_ALLOC      1
/* I2C SAL global variables declaration when kernel disabled */
#ifdef I2C_STATIC_ALLOC
    HAL_I2C_OP HalI2COpSAL;
#endif
 
#if I2C0_USED   /*#if I2C0_USED*/    
#ifdef I2C_STATIC_ALLOC  
    SAL_I2C_MNGT_ADPT   SalI2C0MngtAdpt;
        
    SAL_I2C_HND_PRIV    SalI2C0HndPriv;
    
    HAL_I2C_INIT_DAT    HalI2C0InitData;
   
    IRQ_HANDLE          I2C0IrqHandleDat;
    
    HAL_GDMA_ADAPTER    HalI2C0TxGdmaAdpt;
   
    HAL_GDMA_ADAPTER    HalI2C0RxGdmaAdpt;
     
    HAL_GDMA_OP         HalI2C0GdmaOp;

    IRQ_HANDLE          I2C0TxGdmaIrqHandleDat;
    
    IRQ_HANDLE          I2C0RxGdmaIrqHandleDat;
        
    SAL_I2C_USER_CB     SalI2C0UserCB;
   
    SAL_I2C_USERCB_ADPT SalI2C0UserCBAdpt[SAL_USER_CB_NUM];
    
    SAL_I2C_DMA_USER_DEF    SalI2C0DmaUserDef;
#endif    
#endif          /*#if I2C0_USED*/
 
#if I2C1_USED   /*#if I2C1_USED*/
#ifdef I2C_STATIC_ALLOC   
    SAL_I2C_MNGT_ADPT   SalI2C1MngtAdpt;
       
    SAL_I2C_HND_PRIV    SalI2C1HndPriv;
   
    HAL_I2C_INIT_DAT    HalI2C1InitData;
  
    IRQ_HANDLE          I2C1IrqHandleDat;
 
    HAL_GDMA_ADAPTER    HalI2C1TxGdmaAdpt;

    HAL_GDMA_ADAPTER    HalI2C1RxGdmaAdpt;
    
    HAL_GDMA_OP         HalI2C1GdmaOp;

    IRQ_HANDLE          I2C1TxGdmaIrqHandleDat;

    IRQ_HANDLE          I2C1RxGdmaIrqHandleDat;

    SAL_I2C_USER_CB     SalI2C1UserCB;

    SAL_I2C_USERCB_ADPT SalI2C1UserCBAdpt[SAL_USER_CB_NUM];

    SAL_I2C_DMA_USER_DEF    SalI2C1DmaUserDef;
#endif
#endif          /*#if I2C1_USED*/
 
#if I2C2_USED   /*#if I2C2_USED*/    
#ifdef I2C_STATIC_ALLOC

    SAL_I2C_MNGT_ADPT   SalI2C2MngtAdpt;
    
    SAL_I2C_HND_PRIV    SalI2C2HndPriv;

    HAL_I2C_INIT_DAT    HalI2C2InitData;

    IRQ_HANDLE          I2C2IrqHandleDat;

    HAL_GDMA_ADAPTER    HalI2C2TxGdmaAdpt;
    
    HAL_GDMA_ADAPTER    HalI2C2RxGdmaAdpt;
    
    HAL_GDMA_OP         HalI2C2GdmaOp;

    IRQ_HANDLE          I2C2TxGdmaIrqHandleDat;

    IRQ_HANDLE          I2C2RxGdmaIrqHandleDat;

    SAL_I2C_USER_CB     SalI2C2UserCB;

    SAL_I2C_USERCB_ADPT SalI2C2UserCBAdpt[SAL_USER_CB_NUM];

    SAL_I2C_DMA_USER_DEF    SalI2C2DmaUserDef;
#endif    
#endif          /*#if I2C2_USED*/
 
#if I2C3_USED   /*#if I2C3_USED*/    
#ifdef I2C_STATIC_ALLOC

    SAL_I2C_MNGT_ADPT   SalI2C3MngtAdpt;

    SAL_I2C_HND_PRIV    SalI2C3HndPriv;
 
    HAL_I2C_INIT_DAT    HalI2C3InitData;

    IRQ_HANDLE          I2C3IrqHandleDat;

    HAL_GDMA_ADAPTER    HalI2C3TxGdmaAdpt;

    HAL_GDMA_ADAPTER    HalI2C3RxGdmaAdpt;
    
    HAL_GDMA_OP         HalI2C3GdmaOp;

    IRQ_HANDLE          I2C3TxGdmaIrqHandleDat;

    IRQ_HANDLE          I2C3RxGdmaIrqHandleDat;

    SAL_I2C_USER_CB     SalI2C3UserCB;

    SAL_I2C_USERCB_ADPT SalI2C3UserCBAdpt[SAL_USER_CB_NUM];

    SAL_I2C_DMA_USER_DEF    SalI2C3DmaUserDef;
#endif    
#endif          /*#if I2C3_USED*/

/* Used only for A~C Version */
#ifndef CONFIG_CHIP_E_CUT



VOID 
HalI2COpInit_Patch(
    IN  VOID *Data
)
{
    PHAL_I2C_OP pHalI2COp = (PHAL_I2C_OP) Data;

    pHalI2COp->HalI2CInit       =   HalI2CInit8195a_Patch;
    DBG_I2C_INFO("HalOpInit->HalI2CInit:%x\n",pHalI2COp->HalI2CInit);

    pHalI2COp->HalI2CDeInit     =   HalI2CDeInit8195a;
    DBG_I2C_INFO("HalOpInit->HalI2CDeInit:%x\n",pHalI2COp->HalI2CDeInit);

    pHalI2COp->HalI2CSend       =   HalI2CSendRtl8195a_Patch;
    DBG_I2C_INFO("HalOpInit->HalI2CSend:%x\n",pHalI2COp->HalI2CSend);
    
    pHalI2COp->HalI2CReceive    =   HalI2CReceiveRtl8195a;    
    DBG_I2C_INFO("HalOpInit->HalI2CReceive:%x\n",pHalI2COp->HalI2CReceive);
    
    pHalI2COp->HalI2CEnable     =   HalI2CEnableRtl8195a_Patch;    
    DBG_I2C_INFO("HalOpInit->HalI2CEnable:%x\n",pHalI2COp->HalI2CEnable);
    
    pHalI2COp->HalI2CIntrCtrl   =   HalI2CIntrCtrl8195a; 
    DBG_I2C_INFO("HalOpInit->HalI2CIntrCtrl:%x\n",pHalI2COp->HalI2CIntrCtrl);
    
    pHalI2COp->HalI2CReadReg    =   HalI2CReadRegRtl8195a;
    DBG_I2C_INFO("HalOpInit->HalI2CReadReg:%x\n",pHalI2COp->HalI2CReadReg);

    pHalI2COp->HalI2CWriteReg    =   HalI2CWriteRegRtl8195a;
    DBG_I2C_INFO("pHalI2COp->HalI2CWriteReg:%x\n",pHalI2COp->HalI2CWriteReg);

    pHalI2COp->HalI2CSetCLK     =   HalI2CSetCLKRtl8195a_Patch;
    DBG_I2C_INFO("HalOpInit->HalI2CSetCLK:%x\n",pHalI2COp->HalI2CSetCLK);
    
    pHalI2COp->HalI2CMassSend   =   HalI2CMassSendRtl8195a_Patch;
    DBG_I2C_INFO("HalOpInit->HalI2CMassSend:%x\n",pHalI2COp->HalI2CMassSend);
    
    pHalI2COp->HalI2CClrIntr    =   HalI2CClrIntrRtl8195a;
    DBG_I2C_INFO("HalOpInit->HalI2CClrIntr:%x\n",pHalI2COp->HalI2CClrIntr);
    
    pHalI2COp->HalI2CClrAllIntr =   HalI2CClrAllIntrRtl8195a;
    DBG_I2C_INFO("HalOpInit->HalI2CClrAllIntr:%x\n",pHalI2COp->HalI2CClrAllIntr);
    
    pHalI2COp->HalI2CDMACtrl    =   HalI2CDMACtrl8195a;
    DBG_I2C_INFO("HalOpInit->HalI2CDMACtrl:%x\n",pHalI2COp->HalI2CDMACtrl);
}


//---------------------------------------------------------------------------------------------------
//Function Name:
//		I2CISRHandle
//
// Description:
//         I2C Interrupt Service Routine.
//		According to the input pointer to SAL_I2C_HND, all the rest pointers will be 
//         found and be used to the rest part of this servie routine.
//         The following types of interrupt will be taken care:
//              - General Call  (providing General Call Callback). Slave receives a general call.
//              - STOP Bit       (NOT providing General Call Callback)
//              - START Bit     (NOTproviding General Call Callback)
//              - I2C Activity   (NOTproviding General Call Callback)
//              - RX Done       (providing Error Callback). The slave transmitter does NOT
//                                     receive a proper NACK for the end of whole transfer.
//              - TX Abort       (providing Error Call Callback). The Master/Slave 
//                                    transmitting is terminated.
//              - RD Req         (providing TX and TXC Callback). Slave gets a Read Request
//                                    and starts a slave-transmitter operation. The slave transmit
//                                    data will be written into slave TX FIFO from user data buffer.
//              - TX Empty      (providing TX and TXC Callback). Master TX FIFO is empty.
//                                    The user transmit data will be written into master TX FIFO
//                                    from user data buffer.
//              - TX Over        (providing Error Callback). Master TX FIFO is Overflow.
//              - RX Full         (providing RX and RXC Callback). Master/Slave RX FIFO contains
//                                    data. And the received data will be put into Master/Slave user
//                                    receive data buffer.
//              - RX Over        (providing Error Callback). Master/Slave RX FIFO is Overflow.
//              - RX Under      (providing Error Callback). Master/Slave RX FIFO is Underflow.
//
// Arguments:
//		[in] VOID *Data -
//			I2C SAL handle
//
// Return:
//		NA
//
// Note:
//		NA
//
// See Also:
//		NA
//
// Author:
// 		By Jason Deng, 2014-04-02.
//
//----------------------------------------------------------------------------------------------------
VOID
I2CISRHandle_Patch(
    IN  VOID *Data
){
    PSAL_I2C_HND        pSalI2CHND          = (PSAL_I2C_HND) Data;
    PSAL_I2C_HND_PRIV   pSalI2CHNDPriv      = NULL;
    PSAL_I2C_MNGT_ADPT  pSalI2CMngtAdpt     = NULL;
    PHAL_I2C_INIT_DAT   pHalI2CInitDat      = NULL;
    PHAL_I2C_OP         pHalI2COP           = NULL;    
    PSAL_I2C_USER_CB    pSalI2CUserCB       = NULL;
    u32 I2CLocalTemp    = 0;
    u32 I2CInTOTcnt     = 0;
    u32 I2CIrqIdx       = 0;
    u32 InTimeoutCount  = 0;
    u32 InStartCount    = 0;
    volatile u32 I2CLocalRawSts  = 0;
    u32 I2CStsTmp       = 0;
   
    /* To get the SAL_I2C_MNGT_ADPT pointer, and parse the rest pointers */
    pSalI2CHNDPriv  = CONTAINER_OF(pSalI2CHND, SAL_I2C_HND_PRIV, SalI2CHndPriv);
    pSalI2CMngtAdpt = CONTAINER_OF(pSalI2CHNDPriv->ppSalI2CHnd, SAL_I2C_MNGT_ADPT, pSalHndPriv);
    pHalI2CInitDat  = pSalI2CMngtAdpt->pHalInitDat;
    pHalI2COP       = pSalI2CMngtAdpt->pHalOp;
    I2CInTOTcnt     = pSalI2CMngtAdpt->InnerTimeOut;
    I2CIrqIdx       = pHalI2CInitDat->I2CIdx;
    pSalI2CUserCB   = pSalI2CHND->pUserCB;

    /* I2C General Call Intr*/
    if (pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_INTR_STAT) &
                                BIT_CTRL_IC_INTR_STAT_R_GEN_CALL(1)) {

        DBG_I2C_WARN("I2C%d INTR_GEN_CALL\n",I2CIrqIdx);

        /* Clear I2C interrupt */
        pHalI2CInitDat->I2CIntrClr = REG_DW_I2C_IC_CLR_GEN_CALL;
        pHalI2COP->HalI2CClrIntr(pHalI2CInitDat);

        /* Invoke I2C General Call callback if available*/
        if (pSalI2CUserCB->pGENCALLCB->USERCB != NULL) {
            pSalI2CUserCB->pGENCALLCB->USERCB((void *)pSalI2CUserCB->pGENCALLCB->USERData);
        }            
    }

    /* I2C START DET Intr */
    if (pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_INTR_STAT) &
                                BIT_CTRL_IC_INTR_STAT_R_START_DET(1)) {

        DBG_I2C_WARN("I2C%d INTR_START_DET\n",I2CIrqIdx);

        /* Clear I2C interrupt */
        pHalI2CInitDat->I2CIntrClr = REG_DW_I2C_IC_CLR_START_DET;
        pHalI2COP->HalI2CClrIntr(pHalI2CInitDat);
    }

    /* I2C STOP DET Intr */
    if (pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_INTR_STAT) &
                                BIT_CTRL_IC_INTR_STAT_R_STOP_DET(1)) {

        DBG_I2C_WARN("I2C%d INTR_STOP_DET\n",I2CIrqIdx);

        /* Clear I2C interrupt */
        pHalI2CInitDat->I2CIntrClr = REG_DW_I2C_IC_CLR_STOP_DET;
        pHalI2COP->HalI2CClrIntr(pHalI2CInitDat);
    }

    /* I2C Activity Intr */
    if (pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_INTR_STAT) &
                                BIT_CTRL_IC_INTR_STAT_R_ACTIVITY(1)) {

        DBG_I2C_WARN("I2C%d INTR_ACTIVITY\n",I2CIrqIdx);

        /* Clear I2C interrupt */
        pHalI2CInitDat->I2CIntrClr = REG_DW_I2C_IC_CLR_ACTIVITY;
        pHalI2COP->HalI2CClrIntr(pHalI2CInitDat);
    }
    
    /* I2C RX Done Intr */
    if (pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_INTR_STAT) &
                                BIT_CTRL_IC_INTR_STAT_R_RX_DONE(1)) {
        if ((pSalI2CHND->DevSts == I2C_STS_TX_READY) || (pSalI2CHND->DevSts == I2C_STS_TX_ING)) {
            /* Disable I2C TX Related Interrupts */
            I2CLocalTemp = pHalI2COP->HalI2CReadReg(pHalI2CInitDat, REG_DW_I2C_IC_INTR_MASK);
            I2CLocalTemp &= ~(BIT_IC_INTR_MASK_M_TX_ABRT |
                              BIT_IC_INTR_MASK_M_TX_OVER |
                              BIT_IC_INTR_MASK_M_RX_DONE |
                              BIT_IC_INTR_MASK_M_RD_REQ);
            pHalI2CInitDat->I2CIntrMSK = I2CLocalTemp;
            pHalI2COP->HalI2CIntrCtrl(pHalI2CInitDat);
            pHalI2COP->HalI2CClrAllIntr(pHalI2CInitDat);

