alibaba/AliOS-Things/platform/mcu/rtl8710bn/sdk/component/soc/realtek/8195a/fwlib/src/hal_i2c.c
            /* Update I2C device status */
            pSalI2CHND->DevSts = I2C_STS_IDLE;

            /* Invoke I2C TX complete callback if available */
            if (pSalI2CUserCB->pTXCCB->USERCB != NULL)
                pSalI2CUserCB->pTXCCB->USERCB((void *)pSalI2CUserCB->pTXCCB->USERData);
        } else {
            DBG_I2C_ERR("I2C%d INTR_RX_DONE\n",I2CIrqIdx);
            DBG_I2C_ERR("I2C%d IC_TXFLR:%2x\n",I2CIrqIdx,
            pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_TXFLR));

            /* Clear I2C interrupt */
            pHalI2CInitDat->I2CIntrClr = REG_DW_I2C_IC_CLR_RX_DONE;
            pHalI2COP->HalI2CClrIntr(pHalI2CInitDat); 

            /* Update I2C device status */
            pSalI2CHND->DevSts  = I2C_STS_ERROR;

            /* Update I2C error type */
            pSalI2CHND->ErrType |= I2C_ERR_SLV_TX_NACK;

            /* Invoke I2C error callback if available */
            if (pSalI2CUserCB->pERRCB->USERCB != NULL)
                pSalI2CUserCB->pERRCB->USERCB((void *)pSalI2CUserCB->pERRCB->USERData);
        }
    }

    /* I2C TX Abort Intr */
    if (pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_INTR_STAT) & 
                                BIT_CTRL_IC_INTR_STAT_R_TX_ABRT(1)) {
        I2CStsTmp = pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_TX_ABRT_SOURCE);
        DBG_I2C_ERR("!!!I2C%d INTR_TX_ABRT!!!\n",I2CIrqIdx);
        DBG_I2C_ERR("I2C%d IC_TX_ABRT_SOURCE[%2x]: %x\n", I2CIrqIdx, REG_DW_I2C_IC_TX_ABRT_SOURCE, I2CStsTmp);
        DBG_I2C_ERR("Dev Sts:%x\n",pSalI2CHND->DevSts);
        DBG_I2C_ERR("rx len:%x\n",pSalI2CHND->pRXBuf->DataLen);
        DBG_I2C_ERR("tx len:%x\n",pSalI2CHND->pTXBuf->DataLen);
        DBG_I2C_ERR("raw sts:%x\n",pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_RAW_INTR_STAT));
        DBG_I2C_ERR("ic sts:%x\n",pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_STATUS));
        /* Clear I2C Interrupt */
        pHalI2CInitDat->I2CIntrClr = REG_DW_I2C_IC_CLR_TX_ABRT;
        pHalI2COP->HalI2CClrIntr(pHalI2CInitDat);
        I2CLocalTemp = pSalI2CHND->DevSts;
                
        /* Update I2C device status */
        pSalI2CHND->DevSts  = I2C_STS_ERROR;

        /* Update I2C error type */
        if ((I2CStsTmp & (BIT_IC_TX_ABRT_SOURCE_ABRT_7B_ADDR_NOACK | 
                          BIT_IC_TX_ABRT_SOURCE_ABRT_10ADDR1_NOACK |
                          BIT_IC_TX_ABRT_SOURCE_ABRT_10ADDR2_NOACK)) != 0) {
            pSalI2CHND->ErrType |= I2C_ERR_MST_A_NACK;
        }
        else if ((I2CStsTmp & BIT_IC_TX_ABRT_SOURCE_ABRT_TXDATA_NOACK) != 0){
            pSalI2CHND->ErrType |= I2C_ERR_MST_D_NACK;
        }
        else {
            pSalI2CHND->ErrType |= I2C_ERR_TX_ABRT;
        }
        

        /* Invoke I2C error callback */
        if (pSalI2CUserCB->pERRCB->USERCB != NULL)
            pSalI2CUserCB->pERRCB->USERCB((void *)pSalI2CUserCB->pERRCB->USERData);
			
		if (pSalI2CHND->I2CExd & I2C_EXD_MTR_ADDR_RTY) {
	        if (pSalI2CHND->I2CMaster == I2C_MASTER_MODE) {
	            if ((I2CLocalTemp == I2C_STS_RX_READY) || (I2CLocalTemp == I2C_STS_RX_ING)) {
	                /* Clear Abort source */
	                pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_CLR_TX_ABRT);
                
	                /* Update I2C device status */
	                pSalI2CHND->DevSts  = I2C_STS_RX_ING;
                                    
                    if (pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_STATUS)
                                  & BIT_IC_STATUS_TFNF) {
                        if (pSalI2CMngtAdpt->MstRDCmdCnt > 0) {
                                pHalI2CInitDat->I2CCmd    = I2C_READ_CMD;
                            pHalI2CInitDat->I2CDataLen= 1;
                            pHalI2CInitDat->I2CRWData = pSalI2CHND->pRXBuf->pDataBuf;
                            pHalI2CInitDat->I2CStop   = I2C_STOP_DIS;
                            if ((pSalI2CMngtAdpt->MstRDCmdCnt == 1) && ((pSalI2CHND->I2CExd & I2C_EXD_MTR_HOLD_BUS) == 0))
                                pHalI2CInitDat->I2CStop   = I2C_STOP_EN;
                            pSalI2CMngtAdpt->MstRDCmdCnt--;
                            pHalI2COP->HalI2CMassSend(pHalI2CInitDat);
                        }
                        
                    }
	            }
	            else if ((I2CLocalTemp == I2C_STS_TX_READY) || (I2CLocalTemp == I2C_STS_TX_ING)){
	                /* Clear Abort source */
	                pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_CLR_TX_ABRT);
                              
	                /* Update I2C device status */
	                pSalI2CHND->DevSts  = I2C_STS_TX_ING;

	                /* Return to the former transfer status */                
	                pSalI2CHND->pTXBuf->pDataBuf--;
	                pSalI2CHND->pTXBuf->DataLen++;
                
	                if (pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_STATUS)
	                        & BIT_IC_STATUS_TFNF) {
	                    pHalI2CInitDat->I2CCmd    = I2C_WRITE_CMD;
	                    pHalI2CInitDat->I2CDataLen= 1;
	                    pHalI2CInitDat->I2CRWData = pSalI2CHND->pTXBuf->pDataBuf;
	                    pHalI2CInitDat->I2CStop   = I2C_STOP_DIS;
	                    if ((pSalI2CHND->pTXBuf->DataLen == 1) && ((pSalI2CHND->I2CExd & I2C_EXD_MTR_HOLD_BUS) == 0))
	                        pHalI2CInitDat->I2CStop   = I2C_STOP_EN;

	                    pHalI2COP->HalI2CMassSend(pHalI2CInitDat);

	                    pSalI2CHND->pTXBuf->pDataBuf++;
	                    pSalI2CHND->pTXBuf->DataLen--;
	                }                
	            }
	        }
		}
    }

    /* I2C RD REQ Intr */
    if (pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_INTR_STAT) &
                                BIT_CTRL_IC_INTR_STAT_R_RD_REQ(1)) {
        /* Confirm it's slave mode */
        if (pSalI2CHND->I2CMaster == I2C_SLAVE_MODE) {
            if (pSalI2CHND->DevSts == I2C_STS_IDLE) {
                /* Disable I2C RD REQ Interrupts first */
                I2CLocalTemp = pHalI2COP->HalI2CReadReg(pHalI2CInitDat, REG_DW_I2C_IC_INTR_MASK);
                I2CLocalTemp &= ~(BIT_IC_INTR_MASK_M_RD_REQ);
                pHalI2CInitDat->I2CIntrMSK = I2CLocalTemp;
                pHalI2COP->HalI2CIntrCtrl(pHalI2CInitDat);
                
                /* Invoke I2C rd req callback if available */
                if (pSalI2CUserCB->pRDREQCB->USERCB != NULL)
                    pSalI2CUserCB->pRDREQCB->USERCB((void *)pSalI2CUserCB->pRDREQCB->USERData);
            } else if ((pSalI2CHND->DevSts == I2C_STS_TX_READY) || (pSalI2CHND->DevSts == I2C_STS_TX_ING)) {
                if (pSalI2CHND->pTXBuf->DataLen>0) {
                    /* Update I2C device status */
                    pSalI2CHND->DevSts = I2C_STS_TX_ING;
                    
                    /* Invoke I2C TX callback if available */
                    if (pSalI2CUserCB->pTXCB->USERCB != NULL)
                        pSalI2CUserCB->pTXCB->USERCB((void *)pSalI2CUserCB->pTXCB->USERData);
                        
                    /* I2C Slave transmits data to Master. If the TX FIFO is NOT full,
                                write one byte from slave TX buffer to TX FIFO. */    
                    if ((pHalI2COP->HalI2CReadReg(pHalI2CInitDat, REG_DW_I2C_IC_STATUS)
                                & (BIT_IC_STATUS_TFNF)) == BIT_IC_STATUS_TFNF) {
                        pHalI2CInitDat->I2CCmd    = I2C_WRITE_CMD;
                        pHalI2CInitDat->I2CDataLen= 1;
                        pHalI2CInitDat->I2CRWData = pSalI2CHND->pTXBuf->pDataBuf;
                        pHalI2CInitDat->I2CStop   = I2C_STOP_DIS;
                        if ((pSalI2CHND->pTXBuf->DataLen == 1) && ((pSalI2CHND->I2CExd & I2C_EXD_MTR_HOLD_BUS) == 0))
                            pHalI2CInitDat->I2CStop   = I2C_STOP_EN;

