alibaba/AliOS-Things/platform/mcu/rtl8710bn/sdk/component/soc/realtek/8195a/fwlib/src/hal_i2c.c
                        pHalI2COP->HalI2CMassSend(pHalI2CInitDat);

                        pSalI2CHND->pTXBuf->pDataBuf++;
                        pSalI2CHND->pTXBuf->DataLen--;
                    }
                }
                
                /* To clear Read Request Intr */
                pHalI2CInitDat->I2CIntrClr = REG_DW_I2C_IC_CLR_RD_REQ;
                pHalI2COP->HalI2CClrIntr(pHalI2CInitDat);            

                /* To check I2C slave TX data length. If all the data are transmitted,
                          mask all the interrupts and invoke the user callback */
                if (!pSalI2CHND->pTXBuf->DataLen) {
                    /* This is a software patch */
                    pHalI2COP->HalI2CReadReg(pHalI2CInitDat, REG_DW_I2C_IC_RAW_INTR_STAT);
                    HalDelayUs(1000);
                    
                    /* Disable I2C TX Related Interrupts */
                    I2CLocalTemp = pHalI2COP->HalI2CReadReg(pHalI2CInitDat, REG_DW_I2C_IC_INTR_MASK);
                    I2CLocalTemp &= ~(BIT_IC_INTR_MASK_M_TX_ABRT |
                                      BIT_IC_INTR_MASK_M_TX_OVER |
                                      BIT_IC_INTR_MASK_M_RX_DONE |
                                      BIT_IC_INTR_MASK_M_RD_REQ);
                    pHalI2CInitDat->I2CIntrMSK = I2CLocalTemp;
                    pHalI2COP->HalI2CIntrCtrl(pHalI2CInitDat);
                    pHalI2COP->HalI2CClrAllIntr(pHalI2CInitDat);

                    /* Update I2C device status */
                    pSalI2CHND->DevSts = I2C_STS_IDLE;

                    /* Invoke I2C TX complete callback if available */
                    if (pSalI2CUserCB->pTXCCB->USERCB != NULL)
                        pSalI2CUserCB->pTXCCB->USERCB((void *)pSalI2CUserCB->pTXCCB->USERData);
                }
            }            
        }
    } 

    /* I2C TX Empty Intr */
    if (pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_INTR_STAT) & 
                                BIT_CTRL_IC_INTR_STAT_R_TX_EMPTY(1)) {
        /* Confirm it's master mode */
        if (pSalI2CHND->I2CMaster == I2C_MASTER_MODE) {
        
            /* To check I2C master TX data length. If all the data are transmitted,
                      mask all the interrupts and invoke the user callback */
            if (!pSalI2CHND->pTXBuf->DataLen) {
                /* I2C Disable TX Related Interrupts */
                I2CLocalTemp = pHalI2COP->HalI2CReadReg(pHalI2CInitDat, REG_DW_I2C_IC_INTR_MASK);
                I2CLocalTemp &= ~(BIT_IC_INTR_MASK_M_TX_ABRT  | 
                                  BIT_IC_INTR_MASK_M_TX_EMPTY |
                                  BIT_IC_INTR_MASK_M_TX_OVER);
                pHalI2CInitDat->I2CIntrMSK = I2CLocalTemp;
                pHalI2COP->HalI2CIntrCtrl(pHalI2CInitDat);

                /* Clear all I2C pending interrupts */
                pHalI2COP->HalI2CClrIntr(pHalI2CInitDat);
                /* Update I2C device status */
                pSalI2CHND->DevSts = I2C_STS_IDLE;

                /* Invoke I2C TX Complete callback */
                if (pSalI2CUserCB->pTXCCB->USERCB != NULL)
                    pSalI2CUserCB->pTXCCB->USERCB((void *)pSalI2CUserCB->pTXCCB->USERData);
            }
            
            if (pSalI2CHND->pTXBuf->DataLen > 0) {
                /* Update I2C device status */
                pSalI2CHND->DevSts = I2C_STS_TX_ING;

                /* Invoke I2C TX callback if available */
                if (pSalI2CUserCB->pTXCB->USERCB != NULL)
                    pSalI2CUserCB->pTXCB->USERCB((void *)pSalI2CUserCB->pTXCB->USERData);
                    
                /* Check I2C TX FIFO status. If it's not full, one byte data will be written into it. */
                if ((pHalI2COP->HalI2CReadReg(pHalI2CInitDat, REG_DW_I2C_IC_STATUS)
                            & (BIT_IC_STATUS_TFNF)) == BIT_IC_STATUS_TFNF) {
                    pHalI2CInitDat->I2CCmd    = I2C_WRITE_CMD;
                    pHalI2CInitDat->I2CDataLen= 1;
                    pHalI2CInitDat->I2CRWData = pSalI2CHND->pTXBuf->pDataBuf;
                    pHalI2CInitDat->I2CStop   = I2C_STOP_DIS;
                    pHalI2CInitDat->I2CReSTR  = 1;
                    if ((pSalI2CHND->pTXBuf->DataLen == 1) && ((pSalI2CHND->I2CExd & I2C_EXD_MTR_HOLD_BUS) == 0))
                        pHalI2CInitDat->I2CStop   = I2C_STOP_EN;

                    pHalI2COP->HalI2CMassSend(pHalI2CInitDat);

                    pSalI2CHND->pTXBuf->pDataBuf++;
                    pSalI2CHND->pTXBuf->DataLen--;

                } 
            }            
        }/*if (pSalI2CHND->I2CMaster == I2C_MASTER_MODE)*/   
    }

    /* I2C TX Over Run Intr */
    if (pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_INTR_STAT) & 
                                BIT_CTRL_IC_INTR_STAT_R_TX_OVER(1)) {

        DBG_I2C_ERR("!!!I2C%d INTR_TX_OVER!!!\n",I2CIrqIdx);

        /* Clear I2C interrupt */
        pHalI2CInitDat->I2CIntrClr = REG_DW_I2C_IC_CLR_TX_OVER;
        pHalI2COP->HalI2CClrIntr(pHalI2CInitDat);

        /* Update I2C device status */
        pSalI2CHND->DevSts  = I2C_STS_ERROR;

        /* Update I2C error type */
        pSalI2CHND->ErrType |= I2C_ERR_TX_OVER;

        /* Invoke I2C error callback if available */
        if (pSalI2CUserCB->pERRCB->USERCB != NULL)
            pSalI2CUserCB->pERRCB->USERCB((void *)pSalI2CUserCB->pERRCB->USERData);
    }

    /* I2C RX Full Intr */
    if (pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_INTR_STAT) & 
                                BIT_CTRL_IC_INTR_STAT_R_RX_FULL(1)) {
        /* Check if it's Master */
        if (pSalI2CHND->I2CMaster == I2C_MASTER_MODE){
            
            //DBG_8195A("full\n");
            /* Check if the receive transfer is NOT finished. If it is not, check if there 
                    is data in the RX FIFO and move the data from RX FIFO to user data buffer*/
            if (pSalI2CHND->pRXBuf->DataLen > 0) {
                               
