alibaba/AliOS-Things/platform/mcu/rtl8710bn/sdk/component/soc/realtek/8195a/fwlib/src/hal_i2c.c
                /* Update I2C device status */
                pSalI2CHND->DevSts = I2C_STS_RX_ING;

                /* Invoke I2C RX callback if available */
                if (pSalI2CUserCB->pRXCB->USERCB != NULL)
                    pSalI2CUserCB->pRXCB->USERCB((void *)pSalI2CUserCB->pRXCB->USERData);
                                
                I2CInTOTcnt     = (u32)pSalI2CMngtAdpt->InnerTimeOut;
                InTimeoutCount  = 0;
                /* Calculate internal time out parameters */
                if ((I2CInTOTcnt != 0) && (I2CInTOTcnt != I2C_TIMEOOUT_ENDLESS)) {
                    InTimeoutCount = (I2CInTOTcnt*1000/TIMER_TICK_US);
                    InStartCount = HalTimerOp.HalTimerReadCount(1);
                }

                while (1) {                  
                    I2CLocalRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_STATUS);
                    if ((I2CLocalRawSts & (BIT_IC_STATUS_RFNE | BIT_IC_STATUS_RFF)) != 0) {                    
                        *(pSalI2CHND->pRXBuf->pDataBuf) = 
                                        pHalI2COP->HalI2CReceive(pHalI2CInitDat);
                        //DBG_8195A("rx:%x\n",*(pSalI2CHND->pRXBuf->pDataBuf));
                        pSalI2CHND->pRXBuf->pDataBuf++;
                        pSalI2CHND->pRXBuf->DataLen--;
						
                        if ((pSalI2CHND->pRXBuf->DataLen) == 0)
                            break;
                    }
                    else if ((pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_RAW_INTR_STAT)
                                & (BIT_IC_RAW_INTR_STAT_RX_OVER | BIT_IC_RAW_INTR_STAT_RX_UNDER)) != 0) {
                        break;                        
                    }
                    else {
                        if ((pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_STATUS) & BIT_IC_STATUS_RFNE)
                                            == 0){
                            break;
                        }                    	
                    }

                    if (InTimeoutCount > 0) {
                        if (HAL_TIMEOUT == I2CIsTimeout(InStartCount, InTimeoutCount)) {
                            pSalI2CHND->DevSts  = I2C_STS_TIMEOUT;
                            pSalI2CHND->ErrType = I2C_ERR_RX_FF_TO;
                            DBG_I2C_ERR("RX Full Timeout, I2C%2x,1\n",pSalI2CHND->DevNum);
                            DBG_I2C_ERR("DevSts:%x, ErrType:%x\n", pSalI2CHND->DevSts, pSalI2CHND->ErrType);
                            break;
                        }
                    }
                    else {
                        if (I2CInTOTcnt == 0) {
                            pSalI2CHND->DevSts  = I2C_STS_TIMEOUT;
                            pSalI2CHND->ErrType = I2C_ERR_RX_FF_TO;
                            DBG_I2C_ERR("RX Full Timeout, I2C%2x,2\n",pSalI2CHND->DevNum);
                            DBG_I2C_ERR("DevSts:%x, ErrType:%x\n", pSalI2CHND->DevSts, pSalI2CHND->ErrType);
                            break;
                        }
                    }
                }
            }

            /* To check I2C master RX data length. If all the data are received,
                    mask all the interrupts and invoke the user callback.
                    Otherwise, the master should send another Read Command to slave for
                    the next data byte receiving. */
            if (!pSalI2CHND->pRXBuf->DataLen) {
                /* I2C Disable RX Related Interrupts */
                I2CLocalTemp = pHalI2COP->HalI2CReadReg(pHalI2CInitDat, REG_DW_I2C_IC_INTR_MASK);
                I2CLocalTemp &= ~(BIT_IC_INTR_MASK_M_RX_FULL |
                                  BIT_IC_INTR_MASK_M_RX_OVER |
                                  BIT_IC_INTR_MASK_M_RX_UNDER|
                                  BIT_IC_INTR_MASK_M_TX_ABRT);

                pHalI2CInitDat->I2CIntrMSK = I2CLocalTemp;
                pHalI2COP->HalI2CIntrCtrl(pHalI2CInitDat);

                /* Clear all I2C pending interrupts */
                pHalI2COP->HalI2CClrAllIntr(pHalI2CInitDat);
                /* Update I2C device status */
                pSalI2CHND->DevSts = I2C_STS_IDLE;

                /* Invoke I2C RX complete callback if available */
                if (pSalI2CUserCB->pRXCCB->USERCB != NULL)
                    pSalI2CUserCB->pRXCCB->USERCB((void *)pSalI2CUserCB->pRXCCB->USERData);            
            }
            else {
                /* If TX FIFO is not full, another Read Command is written into it. */
                if (pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_STATUS)
                        & BIT_IC_STATUS_TFNF) {
                    if (pSalI2CMngtAdpt->MstRDCmdCnt > 0) {
                        pHalI2CInitDat->I2CCmd    = I2C_READ_CMD;
                        pHalI2CInitDat->I2CDataLen= 1;
                        pHalI2CInitDat->I2CRWData = pSalI2CHND->pRXBuf->pDataBuf;
                        pHalI2CInitDat->I2CStop   = I2C_STOP_DIS;
                        pHalI2CInitDat->I2CReSTR  = 1;
                        if ((pSalI2CMngtAdpt->MstRDCmdCnt == 1) && ((pSalI2CHND->I2CExd & I2C_EXD_MTR_HOLD_BUS) == 0)){
                            pHalI2CInitDat->I2CStop   = I2C_STOP_EN;
                        }
                        pSalI2CMngtAdpt->MstRDCmdCnt--;
                        pHalI2COP->HalI2CMassSend(pHalI2CInitDat);                        
                    }
                }
            }

        }/*(pSalI2CHND->I2CMaster == I2C_MASTER_MODE)*/
        else{
            /* To check I2C master RX data length. If all the data are received,
                    mask all the interrupts and invoke the user callback.
                    Otherwise, if there is data in the RX FIFO and move the data from RX 
                    FIFO to user data buffer*/
            if (pSalI2CHND->pRXBuf->DataLen > 0){

                /* Update I2C device status */
                pSalI2CHND->DevSts = I2C_STS_RX_ING;

                /* Invoke I2C RX callback if available */
                if (pSalI2CUserCB->pRXCB->USERCB != NULL)
                    pSalI2CUserCB->pRXCB->USERCB((void *)pSalI2CUserCB->pRXCB->USERData);
                    
                if ((pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_STATUS)
                            & (BIT_IC_STATUS_RFNE | BIT_IC_STATUS_RFF)) != 0) {                    
                    *(pSalI2CHND->pRXBuf->pDataBuf) = 
                                    pHalI2COP->HalI2CReceive(pHalI2CInitDat);
                    pSalI2CHND->pRXBuf->pDataBuf++;
                    pSalI2CHND->pRXBuf->DataLen--;
                }
            }

            /* All data are received. Mask all related interrupts. */
            if (!pSalI2CHND->pRXBuf->DataLen){
                /*I2C Disable RX Related Interrupts*/
                I2CLocalTemp = pHalI2COP->HalI2CReadReg(pHalI2CInitDat, REG_DW_I2C_IC_INTR_MASK);
                I2CLocalTemp &= ~(BIT_IC_INTR_MASK_M_RX_FULL |
                                  BIT_IC_INTR_MASK_M_RX_OVER |
                                  BIT_IC_INTR_MASK_M_RX_UNDER);

                pHalI2CInitDat->I2CIntrMSK = I2CLocalTemp;
                pHalI2COP->HalI2CIntrCtrl(pHalI2CInitDat);

