alibaba/AliOS-Things/platform/mcu/rtl8710bn/sdk/component/soc/realtek/8195a/fwlib/src/hal_i2c.c
                /* Update I2C device status */
                pSalI2CHND->DevSts = I2C_STS_IDLE;

                /* Invoke I2C RX complete callback if available */
                if (pSalI2CUserCB->pRXCCB->USERCB != NULL)
                    pSalI2CUserCB->pRXCCB->USERCB((void *)pSalI2CUserCB->pRXCCB->USERData);            
            }
        }
    }

    /*I2C RX Over Run Intr*/
    if (pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_INTR_STAT) & 
                                BIT_CTRL_IC_INTR_STAT_R_RX_OVER(1)) {   

        DBG_I2C_ERR("I2C%d INTR_RX_OVER\n",I2CIrqIdx);

        pHalI2CInitDat->I2CIntrClr = REG_DW_I2C_IC_CLR_RX_OVER;
        pHalI2COP->HalI2CClrIntr(pHalI2CInitDat);

        /* Update I2C device status */
        pSalI2CHND->DevSts  = I2C_STS_ERROR;

        /* Update I2C error type */
        pSalI2CHND->ErrType |= I2C_ERR_RX_OVER;

        /* Invoke I2C error callback if available */
        if (pSalI2CUserCB->pERRCB->USERCB != NULL)
            pSalI2CUserCB->pERRCB->USERCB((void *)pSalI2CUserCB->pERRCB->USERData);
    }

    /*I2C RX Under Run Intr*/
    if (pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_INTR_STAT) &
                                BIT_CTRL_IC_INTR_STAT_R_RX_UNDER(1)) {

        DBG_I2C_ERR("!!!I2C%d INTR_RX_UNDER!!!\n",I2CIrqIdx);

        pHalI2CInitDat->I2CIntrClr = REG_DW_I2C_IC_CLR_RX_UNDER;
        pHalI2COP->HalI2CClrIntr(pHalI2CInitDat);

        /* Update I2C device status */
        pSalI2CHND->DevSts  = I2C_STS_ERROR;

        /* Update I2C error type */
        pSalI2CHND->ErrType |= I2C_ERR_RX_UNDER;

        /* Invoke I2C error callback if available */
        if (pSalI2CUserCB->pERRCB->USERCB != NULL)
            pSalI2CUserCB->pERRCB->USERCB((void *)pSalI2CUserCB->pERRCB->USERData);
    }
}
#endif

//---------------------------------------------------------------------------------------------------
//Function Name:
//		RtkI2CSend
//
// Description:
//         To execute Master-Transmitter and Slave-Transmitter operation.
//         There are 3 operation mode in this function which are separated by compile-time
//          flag.
//         For Master-Transmitter, the User Register Address flag is checked first.
//         User Register Address may be sent before any formal transfer, no matter in
//         Poll-, Intr- or DMA- Mode.
//
//         In Poll-Mode, no matter it's master or slave mode, the transfer will be done in 
//         this function by checking the transfer length.
//              -Master in Poll-Mode: 
//                a. Send the User Register Address if needed.
//                b. Check if all the data are transmitted. If it's NOT, checking the TX FIFO
//                    status is done for writing data from user TX buffer to I2C TX FIFO when
//                    TX FIFO is NOT full.
//                    TX data length  decrements one after writing one byte into TX FIFO.
//                c. b is executed circularly till the TX buffer data length is zero.
//
//              -Slave in Poll-Mode: 
//                    Slave could send data only when it received a Read Commmand matched 
//                    with its own I2C address from other I2C master. Once a slave correctly
//                    received a Read Command matched with its own addr., a Read-Request
//                    flag is set at the same time.
//                    In this Poll-Mode, the slave checks the Read-Request flag to decide
//                    if it could send its TX buffer data.
//                a. Check if the Read-Request flag is set or not. If the flag is set, it should
//                    check if TX buffer data length is zero. If it's NOT, 
//                    the I2C TX FIFO status will be checked for the following operation.
//                b. If the TX FIFO is NOT empty, slave will write one byte data from TX data
//                    buffer to TX FIFO.
//                c. a and b are executed circularly till the TX buffer data length is zero.
//----------------------------------------------------------------------
//         In Intr-Mode, this function is used to unmask the realted I2C interrupt for 
//         the following interrupt operations.
//              -Master in Intr-Mode:
//                a. Send the User Register Address if needed.
//                b. Unmask the TX-Empty and realted error interrupts.
//
//              -Slave in Intr-Mode:
//                a. Unmask the RD-Req and realted error interrupts.
//
// Arguments:
//		[in] VOID *Data -
//			I2C SAL handle
//
// Return:
//		The status of the I2C send process.
//          _EXIT_SUCCESS if the RtkI2CSend succeeded.
//          _EXIT_FAILURE if the RtkI2CSend failed.
//
// Note:
//		NA
//
// See Also:
//		NA
//
// Author:
// 		By Jason Deng, 2014-04-03.
//
//----------------------------------------------------------------------------------------------------
HAL_Status
RtkI2CSend_Patch(
    IN  VOID *Data
){
    PSAL_I2C_HND        pSalI2CHND          = (PSAL_I2C_HND) Data;
    PSAL_I2C_HND_PRIV   pSalI2CHNDPriv      = NULL;
    PSAL_I2C_MNGT_ADPT  pSalI2CMngtAdpt     = NULL;
    PHAL_I2C_INIT_DAT   pHalI2CInitDat      = NULL;
    PHAL_I2C_OP         pHalI2COP           = NULL;    

    PHAL_GDMA_ADAPTER   pHalI2CTxGdmaAdpt   = NULL;
    PHAL_GDMA_OP        pHalI2CGdmaOp       = NULL;
    PSAL_I2C_USER_CB    pSalI2CUserCB       = NULL;
    
    u32 I2CLocalTemp = 0;
    u32 I2CInTOTcnt = 0;
    u32 InTimeoutCount = 0;
    u32 InStartCount = 0;
    u32 I2CChkRawSts = 0;
    u32 I2CChkRawSts2 = 0;
    u32 I2CDataLenBak = 0;
    u32 I2CDataPtrBak = 0;
    //u32 I2CInTOTcntIntr = 0;
    //u32 InTimeoutCountIntr = 0;
    //u32 InStartCountIntr = 0;
    u32 I2CMtrTtyCnt    = 0;
    
    /* To Get the SAL_I2C_MNGT_ADPT Pointer */
    pSalI2CHNDPriv  = CONTAINER_OF(pSalI2CHND, SAL_I2C_HND_PRIV, SalI2CHndPriv);
    pSalI2CMngtAdpt = CONTAINER_OF(pSalI2CHNDPriv->ppSalI2CHnd, SAL_I2C_MNGT_ADPT, pSalHndPriv);

    
    
    pHalI2CInitDat  = pSalI2CMngtAdpt->pHalInitDat;

    pHalI2COP       = pSalI2CMngtAdpt->pHalOp;
    pSalI2CUserCB   = pSalI2CHND->pUserCB;

    pHalI2CTxGdmaAdpt   = pSalI2CMngtAdpt->pHalTxGdmaAdp;
    pHalI2CGdmaOp       = pSalI2CMngtAdpt->pHalGdmaOp;

    /* Check if it's Master Mode */
    if (pSalI2CHND->I2CMaster == I2C_MASTER_MODE) {   
        I2CMtrTtyCnt = 0;
        
