alibaba/AliOS-Things/platform/mcu/rtl8710bn/sdk/component/soc/realtek/8195a/fwlib/src/hal_i2c.c
        /* Master run-time update  target address */
        if (pSalI2CHND->I2CExd & I2C_EXD_MTR_ADDR_UPD) {

            /* Calculate user time out parameters */
            I2CInTOTcnt = pSalI2CHND->TimeOut;
            if ((I2CInTOTcnt != 0) && (I2CInTOTcnt != I2C_TIMEOOUT_ENDLESS)) {
                InTimeoutCount = (I2CInTOTcnt*1000/TIMER_TICK_US);
                InStartCount = HalTimerOp.HalTimerReadCount(1);
            }

            /* Check Master activity status */
            while ((pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_STATUS)) & BIT_IC_STATUS_MST_ACTIVITY) {                
                /* Time-Out check */
                if (InTimeoutCount > 0) {
                    if (HAL_TIMEOUT == I2CIsTimeout(InStartCount, InTimeoutCount)) {
                        pSalI2CHND->DevSts  = I2C_STS_TIMEOUT;
                        pSalI2CHND->ErrType = I2C_ERR_TX_ADD_TO;
                        DBG_I2C_ERR("RtkI2CSend Timeout, I2C%2x,1\n",pSalI2CHND->DevNum);
                        DBG_I2C_ERR("DevSts:%x, ErrType:%x\n", pSalI2CHND->DevSts, pSalI2CHND->ErrType);
                        if (pSalI2CUserCB->pERRCB->USERCB != NULL)
                                    pSalI2CUserCB->pERRCB->USERCB((void *)pSalI2CUserCB->pERRCB->USERData);
                        return HAL_TIMEOUT;
                    }
                }
                else {
                    if (I2CInTOTcnt == 0) {
                        pSalI2CHND->DevSts  = I2C_STS_TIMEOUT;
                        pSalI2CHND->ErrType = I2C_ERR_TX_ADD_TO;
                        DBG_I2C_ERR("RtkI2CSend Timeout, I2C%2x,2\n",pSalI2CHND->DevNum);
                        DBG_I2C_ERR("DevSts:%x, ErrType:%x\n", pSalI2CHND->DevSts, pSalI2CHND->ErrType);
                        if (pSalI2CUserCB->pERRCB->USERCB != NULL)
                                    pSalI2CUserCB->pERRCB->USERCB((void *)pSalI2CUserCB->pERRCB->USERData);
                        return HAL_TIMEOUT;
                    }
                }
            }
            /* Calculate user time out parameters */
            I2CInTOTcnt = pSalI2CHND->TimeOut;
            if ((I2CInTOTcnt != 0) && (I2CInTOTcnt != I2C_TIMEOOUT_ENDLESS)) {
                InTimeoutCount = (I2CInTOTcnt*1000/TIMER_TICK_US);
                InStartCount = HalTimerOp.HalTimerReadCount(1);
            }

            /* Check TX FIFO status */
            while (!((pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_STATUS)) & BIT_IC_STATUS_TFE)) {                
                /* Time-Out check */
                if (InTimeoutCount > 0) {
                    if (HAL_TIMEOUT == I2CIsTimeout(InStartCount, InTimeoutCount)) {
                        pSalI2CHND->DevSts  = I2C_STS_TIMEOUT;
                        pSalI2CHND->ErrType = I2C_ERR_TX_ADD_TO;
                        DBG_I2C_ERR("RtkI2CSend Timeout, I2C%2x,3\n",pSalI2CHND->DevNum);
                        DBG_I2C_ERR("DevSts:%x, ErrType:%x\n", pSalI2CHND->DevSts, pSalI2CHND->ErrType);
                        if (pSalI2CUserCB->pERRCB->USERCB != NULL)
                                    pSalI2CUserCB->pERRCB->USERCB((void *)pSalI2CUserCB->pERRCB->USERData);
                        return HAL_TIMEOUT;
                    }
                }
                else {
                    if (I2CInTOTcnt == 0) {
                        pSalI2CHND->DevSts  = I2C_STS_TIMEOUT;
                        pSalI2CHND->ErrType = I2C_ERR_TX_ADD_TO;
                        DBG_I2C_ERR("RtkI2CSend Timeout, I2C%2x,4\n",pSalI2CHND->DevNum);
                        DBG_I2C_ERR("DevSts:%x, ErrType:%x\n", pSalI2CHND->DevSts, pSalI2CHND->ErrType);
                        if (pSalI2CUserCB->pERRCB->USERCB != NULL)
                                    pSalI2CUserCB->pERRCB->USERCB((void *)pSalI2CUserCB->pERRCB->USERData);
                        return HAL_TIMEOUT;
                    }
                }
            }

            I2CLocalTemp = 0;
            I2CLocalTemp = pHalI2COP->HalI2CReadReg(pHalI2CInitDat, REG_DW_I2C_IC_TAR);
            I2CLocalTemp &= (~BIT_MASK_IC_TAR);
            I2CLocalTemp |= BIT_CTRL_IC_TAR(pSalI2CHND->pTXBuf->TargetAddr);
            /* Update Master Target address */
            pHalI2COP->HalI2CWriteReg(pHalI2CInitDat, REG_DW_I2C_IC_TAR, I2CLocalTemp);
        }

        RtkI2CSendUserAddr(pSalI2CHND, 0);      

        /* #if I2C_POLL_OP_TYPE */
        if (pSalI2CHND->OpType == I2C_POLL_TYPE) { /* if (pSalI2CHND->OpType == I2C_POLL_TYPE) */
            /* I2C Device Status Update */
            pSalI2CHND->DevSts  = I2C_STS_TX_READY;

            /* Calculate user time out parameters */
            I2CInTOTcnt = pSalI2CHND->TimeOut;
            if ((I2CInTOTcnt != 0) && (I2CInTOTcnt != I2C_TIMEOOUT_ENDLESS)) {
                InTimeoutCount = (I2CInTOTcnt*1000/TIMER_TICK_US);
                InStartCount = HalTimerOp.HalTimerReadCount(1);
            }
            
            /* Send data till the TX buffer data length is zero */
            for (;pSalI2CHND->pTXBuf->DataLen>0;) {
                /* I2C Device Status Update */
                pSalI2CHND->DevSts  = I2C_STS_TX_ING;
                
                /* Check I2C TX FIFO status */
                if ((pHalI2COP->HalI2CReadReg(pHalI2CInitDat, REG_DW_I2C_IC_STATUS)
                            & (BIT_IC_STATUS_TFNF)) == BIT_IC_STATUS_TFNF) {
                    /* Wrtie data into I2C TX FIFO */
                    pHalI2CInitDat->I2CCmd    = I2C_WRITE_CMD;
                    pHalI2CInitDat->I2CDataLen= 1;
                    pHalI2CInitDat->I2CRWData = pSalI2CHND->pTXBuf->pDataBuf;
                    pHalI2CInitDat->I2CStop   = I2C_STOP_DIS;
                    if ((pSalI2CHND->pTXBuf->DataLen == 1) && ((pSalI2CHND->I2CExd & I2C_EXD_MTR_HOLD_BUS) == 0))
                        pHalI2CInitDat->I2CStop   = I2C_STOP_EN;
                    pHalI2COP->HalI2CMassSend(pHalI2CInitDat);

                    pSalI2CHND->pTXBuf->pDataBuf++;
                    pSalI2CHND->pTXBuf->DataLen--;
                }
                else {
                    /* Time-Out check */
                    if (InTimeoutCount > 0) {
                        if (HAL_TIMEOUT == I2CIsTimeout(InStartCount, InTimeoutCount)) {
                            pSalI2CHND->DevSts  = I2C_STS_TIMEOUT;
                            pSalI2CHND->ErrType = I2C_ERR_TX_CMD_TO;
                            DBG_I2C_ERR("RtkI2CSend Timeout, I2C%2x,5\n",pSalI2CHND->DevNum);
                            DBG_I2C_ERR("DevSts:%x, ErrType:%x\n", pSalI2CHND->DevSts, pSalI2CHND->ErrType);
                            if (pSalI2CUserCB->pERRCB->USERCB != NULL)
                                    pSalI2CUserCB->pERRCB->USERCB((void *)pSalI2CUserCB->pERRCB->USERData);
                            return HAL_TIMEOUT;
                        }
                    }
                    else {
                        if (I2CInTOTcnt == 0) {
                            pSalI2CHND->DevSts  = I2C_STS_TIMEOUT;
                            pSalI2CHND->ErrType = I2C_ERR_TX_CMD_TO;
                            DBG_I2C_ERR("RtkI2CSend Timeout, I2C%2x,6\n",pSalI2CHND->DevNum);
                            DBG_I2C_ERR("DevSts:%x, ErrType:%x\n", pSalI2CHND->DevSts, pSalI2CHND->ErrType);
                            if (pSalI2CUserCB->pERRCB->USERCB != NULL)
                                    pSalI2CUserCB->pERRCB->USERCB((void *)pSalI2CUserCB->pERRCB->USERData);
                            return HAL_TIMEOUT;
                        }
                    }
                }
				
				if (pSalI2CHND->I2CExd & I2C_EXD_MTR_ADDR_RTY) {
					HalDelayUs(((1000*30)/pHalI2CInitDat->I2CClk));    //the 10 is for ten bit time                  
                    I2CLocalTemp = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_RAW_INTR_STAT);
	                if (I2CLocalTemp & BIT_IC_RAW_INTR_STAT_TX_ABRT) {
                        I2CMtrTtyCnt++;
                        I2CLocalTemp = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_TX_ABRT_SOURCE);
	                    if (I2CMtrTtyCnt > I2C_MTR_RTY_CNT) {
                            if ((I2CLocalTemp & (BIT_IC_TX_ABRT_SOURCE_ABRT_7B_ADDR_NOACK | 
                                              BIT_IC_TX_ABRT_SOURCE_ABRT_10ADDR1_NOACK |
                                              BIT_IC_TX_ABRT_SOURCE_ABRT_10ADDR2_NOACK)) != 0) {
                                pSalI2CHND->ErrType |= I2C_ERR_MST_A_NACK;
                            }
                            else if ((I2CLocalTemp & BIT_IC_TX_ABRT_SOURCE_ABRT_TXDATA_NOACK) != 0){
                                pSalI2CHND->ErrType |= I2C_ERR_MST_D_NACK;
                            }
                            else {
                                pSalI2CHND->ErrType |= I2C_ERR_TX_ABRT;
                            }
                            
                            pSalI2CHND->DevSts  = I2C_STS_ERROR;
                            pSalI2CHND->pTXBuf->pDataBuf--;
                            pSalI2CHND->pTXBuf->DataLen++;
                            if (pSalI2CUserCB->pERRCB->USERCB != NULL)
                                pSalI2CUserCB->pERRCB->USERCB((void *)pSalI2CUserCB->pERRCB->USERData);
                            return HAL_ERR_HW;
	                    }
	                    pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_CLR_TX_ABRT);
	                    pSalI2CHND->pTXBuf->pDataBuf--;
	                    pSalI2CHND->pTXBuf->DataLen++;
	                }
				}           
            }

            /* Calculate user time out parameters */
            I2CInTOTcnt = pSalI2CMngtAdpt->InnerTimeOut;
            if ((I2CInTOTcnt != 0) && (I2CInTOTcnt != I2C_TIMEOOUT_ENDLESS)) {
                InTimeoutCount = (I2CInTOTcnt*1000/TIMER_TICK_US);
                InStartCount = HalTimerOp.HalTimerReadCount(1);
            }
            /* I2C Wait TX FIFO Empty */
            while (1) {
                if ((pHalI2COP->HalI2CReadReg(pHalI2CInitDat, REG_DW_I2C_IC_STATUS)
                        & (BIT_IC_STATUS_TFE | BIT_IC_STATUS_TFNF)) ==
                          (BIT_IC_STATUS_TFE | BIT_IC_STATUS_TFNF)){
					break;  	  
				}
				else {
					/* Time-Out check */
	                if (InTimeoutCount > 0) {
	                    if (HAL_TIMEOUT == I2CIsTimeout(InStartCount, InTimeoutCount)) {
	                        pSalI2CHND->DevSts  = I2C_STS_TIMEOUT;
	                        pSalI2CHND->ErrType = I2C_ERR_TX_FF_TO;
	                        DBG_I2C_ERR("RtkI2CSend Timeout, I2C%2x,7\n",pSalI2CHND->DevNum);
	                        DBG_I2C_ERR("DevSts:%x, ErrType:%x\n", pSalI2CHND->DevSts, pSalI2CHND->ErrType);
	                        if (pSalI2CUserCB->pERRCB->USERCB != NULL)
                                    pSalI2CUserCB->pERRCB->USERCB((void *)pSalI2CUserCB->pERRCB->USERData);
	                        return HAL_TIMEOUT;
	                    }
	                }
	                else {
	                    if (I2CInTOTcnt == 0) {
	                        pSalI2CHND->DevSts  = I2C_STS_TIMEOUT;
	                        pSalI2CHND->ErrType = I2C_ERR_TX_FF_TO;
	                        DBG_I2C_ERR("RtkI2CSend Timeout, I2C%2x,8\n",pSalI2CHND->DevNum);
	                        DBG_I2C_ERR("DevSts:%x, ErrType:%x\n", pSalI2CHND->DevSts, pSalI2CHND->ErrType);
	                        if (pSalI2CUserCB->pERRCB->USERCB != NULL)
                                    pSalI2CUserCB->pERRCB->USERCB((void *)pSalI2CUserCB->pERRCB->USERData);
	                        return HAL_TIMEOUT;
	                    }
	                }
				}                
            }

            /* Invoke I2C TX complete callback if available */
            if (pSalI2CUserCB->pTXCCB->USERCB != NULL)
                pSalI2CUserCB->pTXCCB->USERCB((void *)pSalI2CUserCB->pTXCCB->USERData);
                
            /* I2C Device Status Update */
            pSalI2CHND->DevSts  = I2C_STS_IDLE;
        }/* if (pSalI2CHND->OpType == I2C_POLL_TYPE) */
        /* #if I2C_POLL_OP_TYPE */

