alibaba/AliOS-Things/platform/mcu/rtl8710bn/sdk/component/soc/realtek/8195a/fwlib/src/hal_i2c.c
#if I2C_INTR_OP_TYPE
        if (pSalI2CHND->OpType == I2C_INTR_TYPE) {  /* if (pSalI2CHND->OpType == I2C_INTR_TYPE) */
			/* Calculate user time out parameters */
			InTimeoutCount = 0;
			InStartCount = 0;
            I2CInTOTcnt = pSalI2CHND->TimeOut;

            //InTimeoutCountIntr = 0;
            //InStartCountIntr = 0;            
            //I2CInTOTcntIntr = pSalI2CHND->AddRtyTimeOut;
            
            if ((I2CInTOTcnt != 0) && (I2CInTOTcnt != I2C_TIMEOOUT_ENDLESS)) {
                InTimeoutCount = (I2CInTOTcnt*1000/TIMER_TICK_US);
                InStartCount = HalTimerOp.HalTimerReadCount(1);
            }

            //InTimeoutCountIntr = (I2CInTOTcntIntr*1000/TIMER_TICK_US);
            //InStartCountIntr = HalTimerOp.HalTimerReadCount(1);

            
            I2CDataLenBak = (u32)(pSalI2CHND->pTXBuf->DataLen);
            I2CDataPtrBak = (u32)(pSalI2CHND->pTXBuf->pDataBuf);
            /* I2C Device Status Update */
            pSalI2CHND->DevSts = I2C_STS_IDLE;
            pHalI2CInitDat->I2CIntrClr = REG_DW_I2C_IC_CLR_TX_ABRT;
            pHalI2COP->HalI2CClrIntr(pHalI2CInitDat);
            pHalI2COP->HalI2CClrAllIntr(pHalI2CInitDat);
            
            /* Send data till the TX buffer data length is zero */
            for (;;) {
SEND_I2C_WR_CMD_INTR:

                /* I2C Device Status Update */
                pSalI2CHND->DevSts  = I2C_STS_TX_ING;

                /* Check I2C TX FIFO status */
                /* Fill TX FIFO only when it's completely empty */
                I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_STATUS);
                if ((I2CChkRawSts & BIT_IC_STATUS_TFE) == BIT_IC_STATUS_TFE) {
                    if (pSalI2CHND->pTXBuf->DataLen > 0) {
                        /* Wrtie data into I2C TX FIFO */
                        pHalI2CInitDat->I2CCmd    = I2C_WRITE_CMD;
                        pHalI2CInitDat->I2CDataLen= 1;
                        pHalI2CInitDat->I2CRWData = pSalI2CHND->pTXBuf->pDataBuf;
                        pHalI2CInitDat->I2CStop     = I2C_STOP_DIS;
                            
                        if ((pSalI2CHND->pTXBuf->DataLen == 1) && ((pSalI2CHND->I2CExd & I2C_EXD_MTR_HOLD_BUS) == 0))
                            pHalI2CInitDat->I2CStop   = I2C_STOP_EN;

                        if ((pHalI2CInitDat->I2CReSTR == 1) && (pSalI2CHND->pTXBuf->DataLen == I2CDataLenBak)){
                            pHalI2CInitDat->RSVD0 |= BIT0;
                        }
                        
                        pHalI2COP->HalI2CMassSend(pHalI2CInitDat);

                        pSalI2CHND->pTXBuf->pDataBuf++;
                        pSalI2CHND->pTXBuf->DataLen--;
                        
                        if (pHalI2CInitDat->I2CReSTR == 1) {
                            pHalI2CInitDat->RSVD0 &= (~BIT0);
                        }
                    }
                }
                				
				if (pSalI2CHND->I2CExd & I2C_EXD_MTR_ADDR_RTY) {
                    u32 I2CInTOTcntRty      = 0;
                    u32 InTimeoutCountRty   = 0;
                    u32 InStartCountRty     = 0;
                    
#if 0
                    /* SEND_I2C_WR_CMD_INTR Time-Out check */
                    if (InTimeoutCountIntr > 0) {
                        if (HAL_TIMEOUT == I2CIsTimeout(InStartCountIntr, InTimeoutCountIntr)) {
                            /* Reset the data count before status return */
                            pSalI2CHND->pTXBuf->pDataBuf--;
                            pSalI2CHND->pTXBuf->DataLen++;
                            return HAL_TIMEOUT;
                        }
                    }
#endif
                    /* Calculate user master retry local time out parameters */
        			InTimeoutCountRty   = 0;
        			InStartCountRty     = 0;
                    I2CInTOTcntRty      = pSalI2CHND->TimeOut;          
                    
                    if ((I2CInTOTcntRty != 0) && (I2CInTOTcntRty!= I2C_TIMEOOUT_ENDLESS)) {
                        InTimeoutCountRty= (I2CInTOTcntRty*1000/TIMER_TICK_US);
                        InStartCountRty= HalTimerOp.HalTimerReadCount(1);
                    }
                    I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_STATUS);
                    while ((I2CChkRawSts & BIT_IC_STATUS_TFE) == 0) {
                        I2CChkRawSts2 = pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_RAW_INTR_STAT);
	                    if ((I2CChkRawSts2 & BIT_IC_RAW_INTR_STAT_TX_ABRT) != 0){
                            break;
	                    }
	                    
                        /* Time-Out check */
                        if (InTimeoutCountRty > 0) {
                            if (HAL_TIMEOUT == I2CIsTimeout(InStartCountRty, InTimeoutCountRty)) {
                                break;
                            }
                        }
                        else {
                            if (I2CInTOTcntRty == 0) {
                                break;
                            }
                        }
                        
                        /* Read I2C IC status again */
	                    I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_STATUS);
                    }

                    HalDelayUs((u32)((1000*30)/pHalI2CInitDat->I2CClk));    //the 10 is for ten bit time                  
                    
                    I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_RAW_INTR_STAT);
	                if (I2CChkRawSts & BIT_IC_RAW_INTR_STAT_TX_ABRT) {
	                    I2CMtrTtyCnt++;
	                    I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_TX_ABRT_SOURCE);
	                    if (I2CMtrTtyCnt > I2C_MTR_RTY_CNT) {
                            if ((I2CChkRawSts & (BIT_IC_TX_ABRT_SOURCE_ABRT_7B_ADDR_NOACK | 
                                              BIT_IC_TX_ABRT_SOURCE_ABRT_10ADDR1_NOACK |
                                              BIT_IC_TX_ABRT_SOURCE_ABRT_10ADDR2_NOACK)) != 0) {
                                pSalI2CHND->ErrType |= I2C_ERR_MST_A_NACK;
                            }
                            else if ((I2CChkRawSts & BIT_IC_TX_ABRT_SOURCE_ABRT_TXDATA_NOACK) != 0){
                                pSalI2CHND->ErrType |= I2C_ERR_MST_D_NACK;
                            }
                            else {
                                pSalI2CHND->ErrType |= I2C_ERR_TX_ABRT;
                            }
                            pSalI2CHND->DevSts  = I2C_STS_ERROR;
                            pSalI2CHND->pTXBuf->pDataBuf--;
                            pSalI2CHND->pTXBuf->DataLen++;
                            if (pSalI2CUserCB->pERRCB->USERCB != NULL)
                                pSalI2CUserCB->pERRCB->USERCB((void *)pSalI2CUserCB->pERRCB->USERData);
                            return HAL_ERR_HW;
	                    }
	                    
						/* use InTimeoutCount to backup tar here */
                        InTimeoutCount = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat, REG_DW_I2C_IC_TAR);
                        InTimeoutCount = BIT_GET_IC_TAR(InTimeoutCount);
						
