alibaba/AliOS-Things/platform/mcu/rtl8710bn/sdk/component/soc/realtek/8195a/fwlib/src/hal_i2c.c
	                    RtkI2CDeInitForPS(pSalI2CHND);
                        I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_ENABLE_STATUS);
                        while((I2CChkRawSts & BIT_IC_ENABLE_STATUS_IC_EN) == BIT_IC_ENABLE_STATUS_IC_EN){
                            I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_ENABLE_STATUS);
                        }
                        
                        
                        RtkI2CInitForPS(pSalI2CHND);

                        pSalI2CHND->pInitDat->I2CAckAddr = InTimeoutCount;
                        HalI2CSetTarRtl8195a(pSalI2CHND->pInitDat);
                        
                        I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_ENABLE_STATUS);
                        while((I2CChkRawSts & BIT_IC_ENABLE_STATUS_IC_EN) != BIT_IC_ENABLE_STATUS_IC_EN){
                            I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_ENABLE_STATUS);
                        }

                        pSalI2CHND->DevSts  = I2C_STS_TX_READY;
                        pSalI2CHND->ErrType = 0;
                        pSalI2CHND->pTXBuf->DataLen = (u16)I2CDataLenBak;
                        pSalI2CHND->pTXBuf->pDataBuf= (u8*)I2CDataPtrBak;
                        /* Calculate user time out parameters */
            			InTimeoutCount = 0;
            			InStartCount = 0;
                        I2CInTOTcnt = pSalI2CHND->TimeOut;          
                        if ((I2CInTOTcnt != 0) && (I2CInTOTcnt != I2C_TIMEOOUT_ENDLESS)) {
                            InTimeoutCount = (I2CInTOTcnt*1000/TIMER_TICK_US);
                            InStartCount = HalTimerOp.HalTimerReadCount(1);
                        }
                        goto SEND_I2C_WR_CMD_INTR;

	                }
	                else if (((u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_STATUS) & BIT_IC_STATUS_TFE) != BIT_IC_STATUS_TFE) {
                        I2CMtrTtyCnt++;
                        I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_TX_ABRT_SOURCE);
	                    if (I2CMtrTtyCnt > I2C_MTR_RTY_CNT) {
                            if ((I2CChkRawSts & (BIT_IC_TX_ABRT_SOURCE_ABRT_7B_ADDR_NOACK | 
                                          BIT_IC_TX_ABRT_SOURCE_ABRT_10ADDR1_NOACK |
                                          BIT_IC_TX_ABRT_SOURCE_ABRT_10ADDR2_NOACK)) != 0) {
                                pSalI2CHND->ErrType |= I2C_ERR_MST_A_NACK;
                            }
                            else if ((I2CChkRawSts & BIT_IC_TX_ABRT_SOURCE_ABRT_TXDATA_NOACK) != 0){
                                pSalI2CHND->ErrType |= I2C_ERR_MST_D_NACK;
                            }
                            else {
                                pSalI2CHND->ErrType |= I2C_ERR_TX_ABRT;
                            }
                            pSalI2CHND->DevSts  = I2C_STS_ERROR;
                            pSalI2CHND->pTXBuf->pDataBuf--;
                            pSalI2CHND->pTXBuf->DataLen++;
                            if (pSalI2CUserCB->pERRCB->USERCB != NULL)
                                pSalI2CUserCB->pERRCB->USERCB((void *)pSalI2CUserCB->pERRCB->USERData);
                            return HAL_ERR_HW;
	                    }
	                    /* use InTimeoutCount to backup tar here */
                        InTimeoutCount = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat, REG_DW_I2C_IC_TAR);
                        InTimeoutCount = BIT_GET_IC_TAR(InTimeoutCount);
                        
                        RtkI2CDeInitForPS(pSalI2CHND);
                        I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_ENABLE_STATUS);
                        while((I2CChkRawSts & BIT_IC_ENABLE_STATUS_IC_EN) == BIT_IC_ENABLE_STATUS_IC_EN){
                            I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_ENABLE_STATUS);
                        }

                        
                        
                        RtkI2CInitForPS(pSalI2CHND);

                        pSalI2CHND->pInitDat->I2CAckAddr = InTimeoutCount;
                        HalI2CSetTarRtl8195a(pSalI2CHND->pInitDat);

                        I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_ENABLE_STATUS);
                        while((I2CChkRawSts & BIT_IC_ENABLE_STATUS_IC_EN) != BIT_IC_ENABLE_STATUS_IC_EN){
                            I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_ENABLE_STATUS);
                        }

                        pSalI2CHND->DevSts  = I2C_STS_TX_READY;
                        pSalI2CHND->ErrType = 0;
                        pSalI2CHND->pTXBuf->DataLen = (u16)I2CDataLenBak;
                        pSalI2CHND->pTXBuf->pDataBuf= (u8 *)I2CDataPtrBak;
                        /* Calculate user time out parameters */
            			InTimeoutCount = 0;
            			InStartCount = 0;
                        I2CInTOTcnt = pSalI2CHND->TimeOut;          
                        if ((I2CInTOTcnt != 0) && (I2CInTOTcnt != I2C_TIMEOOUT_ENDLESS)) {
                            InTimeoutCount = (I2CInTOTcnt*1000/TIMER_TICK_US);
                            InStartCount = HalTimerOp.HalTimerReadCount(1);
                        }
                        goto SEND_I2C_WR_CMD_INTR;        
	               	}      
	               	else {                 
			            /* I2C Enable TX Related Interrupts */
			            I2CLocalTemp = 0;
			            I2CLocalTemp = pHalI2COP->HalI2CReadReg(pHalI2CInitDat, REG_DW_I2C_IC_INTR_MASK);
			            I2CLocalTemp |= (BIT_IC_INTR_MASK_M_TX_ABRT  | 
			                             BIT_IC_INTR_MASK_M_TX_EMPTY |
			                             BIT_IC_INTR_MASK_M_TX_OVER);
			            pHalI2CInitDat->I2CIntrMSK = I2CLocalTemp;
			            pHalI2COP->HalI2CIntrCtrl(pHalI2CInitDat);
			                                        
                        break;
                    }
				} 
				else {
				    I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_STATUS);
                    while ((I2CChkRawSts & BIT_IC_STATUS_TFE) == 0) {
                        I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_STATUS);
                    }
                    
				    I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_STATUS);
	                if (I2CChkRawSts & BIT_IC_STATUS_TFE) {

	                    if (pSalI2CHND->pTXBuf->DataLen > 0) {
    			            /* I2C Enable TX Related Interrupts */
    			            I2CLocalTemp = 0;
    			            I2CLocalTemp = pHalI2COP->HalI2CReadReg(pHalI2CInitDat, REG_DW_I2C_IC_INTR_MASK);
    			            I2CLocalTemp |= (BIT_IC_INTR_MASK_M_TX_ABRT  | 
    			                             BIT_IC_INTR_MASK_M_TX_EMPTY |
    			                             BIT_IC_INTR_MASK_M_TX_OVER);
    			            pHalI2CInitDat->I2CIntrMSK = I2CLocalTemp;
    			            pHalI2COP->HalI2CIntrCtrl(pHalI2CInitDat);                            
                        }
                        else {
                            /* Invoke I2C TX complete callback if available */
                            if (pSalI2CUserCB->pTXCCB->USERCB != NULL)
                                pSalI2CUserCB->pTXCCB->USERCB((void *)pSalI2CUserCB->pTXCCB->USERData);
							
							/* I2C Device Status Update */
							pSalI2CHND->DevSts  = I2C_STS_IDLE;
                        }
                        
