alibaba/AliOS-Things/platform/mcu/rtl8710bn/sdk/component/soc/realtek/8195a/fwlib/src/hal_i2c.c
                        break;  //end of send process in INTR mode
	                }
				}

				/* Time-Out check */
                if (InTimeoutCount > 0) {
                    if (HAL_TIMEOUT == I2CIsTimeout(InStartCount, InTimeoutCount)) {
                        pSalI2CHND->DevSts  = I2C_STS_TIMEOUT;
                        pSalI2CHND->ErrType = I2C_ERR_TX_FF_TO;
                        //DBG_I2C_ERR("RtkI2CSend Timeout, I2C%2x,7\n",pSalI2CHND->DevNum);
                        //DBG_I2C_ERR("DevSts:%x, ErrType:%x\n", pSalI2CHND->DevSts, pSalI2CHND->ErrType);
                        if (pSalI2CUserCB->pERRCB->USERCB != NULL)
                                    pSalI2CUserCB->pERRCB->USERCB((void *)pSalI2CUserCB->pERRCB->USERData);

                        /* use InTimeoutCount to backup tar here */
                        InTimeoutCount = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat, REG_DW_I2C_IC_TAR);
                        InTimeoutCount = BIT_GET_IC_TAR(InTimeoutCount);
                        
                        RtkI2CDeInitForPS(pSalI2CHND);
                        I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_ENABLE_STATUS);
                        while((I2CChkRawSts & BIT_IC_ENABLE_STATUS_IC_EN) == BIT_IC_ENABLE_STATUS_IC_EN){
                            I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_ENABLE_STATUS);
                        }

                        
                        
                        RtkI2CInitForPS(pSalI2CHND);

                        pSalI2CHND->pInitDat->I2CAckAddr = InTimeoutCount;
                        HalI2CSetTarRtl8195a(pSalI2CHND->pInitDat);

                        I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_ENABLE_STATUS);
                        while((I2CChkRawSts & BIT_IC_ENABLE_STATUS_IC_EN) != BIT_IC_ENABLE_STATUS_IC_EN){
                            I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_ENABLE_STATUS);
                        }
                        return HAL_TIMEOUT;
                    }
                }
                else {
                    if (I2CInTOTcnt == 0) {
                        pSalI2CHND->DevSts  = I2C_STS_TIMEOUT;
                        pSalI2CHND->ErrType = I2C_ERR_TX_FF_TO;
                        if (pSalI2CUserCB->pERRCB->USERCB != NULL)
                                    pSalI2CUserCB->pERRCB->USERCB((void *)pSalI2CUserCB->pERRCB->USERData);

                        /* use InTimeoutCount to backup tar here */
                        InTimeoutCount = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat, REG_DW_I2C_IC_TAR);
                        InTimeoutCount = BIT_GET_IC_TAR(InTimeoutCount);
                        
                        RtkI2CDeInitForPS(pSalI2CHND);
                        I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_ENABLE_STATUS);
                        while((I2CChkRawSts & BIT_IC_ENABLE_STATUS_IC_EN) == BIT_IC_ENABLE_STATUS_IC_EN){
                            I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_ENABLE_STATUS);
                        }

                        
                        
                        RtkI2CInitForPS(pSalI2CHND);

                        pSalI2CHND->pInitDat->I2CAckAddr = InTimeoutCount;
                        HalI2CSetTarRtl8195a(pSalI2CHND->pInitDat);

                        I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_ENABLE_STATUS);
                        while((I2CChkRawSts & BIT_IC_ENABLE_STATUS_IC_EN) != BIT_IC_ENABLE_STATUS_IC_EN){
                            I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_ENABLE_STATUS);
                        }
                        return HAL_TIMEOUT;
                    }
                }
            }
        }                                           /* if (pSalI2CHND->OpType == I2C_INTR_TYPE) */
#endif

        /* if (pSalI2CHND->OpType == I2C_DMA_TYPE) */
        if (pSalI2CHND->OpType == I2C_DMA_TYPE) {  
            /* I2C Device Status Update */
            pSalI2CHND->DevSts  = I2C_STS_TX_READY;
            
            /* I2C Enable TX Related Interrupts */
            I2CLocalTemp = pHalI2COP->HalI2CReadReg(pHalI2CInitDat, REG_DW_I2C_IC_INTR_MASK);
            I2CLocalTemp |= (BIT_IC_INTR_MASK_M_TX_ABRT  |
                             BIT_IC_INTR_MASK_M_TX_OVER);
            pHalI2CInitDat->I2CIntrMSK = I2CLocalTemp;
            pHalI2COP->HalI2CIntrCtrl(pHalI2CInitDat);

            //HalGdmaOpInit(pHalI2CGdmaOp);
            pSalI2CMngtAdpt->pHalGdmaOpInit(pHalI2CGdmaOp);
            pHalI2CTxGdmaAdpt->GdmaCtl.BlockSize    = pSalI2CHND->pTXBuf->DataLen;
            pHalI2CTxGdmaAdpt->ChSar                = (u32)pSalI2CHND->pTXBuf->pDataBuf;
            pHalI2CTxGdmaAdpt->ChDar                = (u32)(I2C0_REG_BASE+REG_DW_I2C_IC_DATA_CMD+
                                                                pSalI2CHND->DevNum*0x400);
            pHalI2CGdmaOp->HalGdmaChSeting(pHalI2CTxGdmaAdpt);
            pHalI2CGdmaOp->HalGdmaChEn(pHalI2CTxGdmaAdpt);
            pSalI2CHND->DevSts  = I2C_STS_TX_ING;
            pHalI2CInitDat->I2CDMACtrl = BIT_CTRL_IC_DMA_CR_TDMAE(1);
            pHalI2COP->HalI2CDMACtrl(pHalI2CInitDat);
            
        }                                           
        /* if (pSalI2CHND->OpType == I2C_DMA_TYPE) */

    }/* if (pSalI2CHND->I2CMaster == I2C_MASTER_MODE) */
    else{ 
        /* #if I2C_POLL_OP_TYPE */
        if (pSalI2CHND->OpType == I2C_POLL_TYPE) {
            /* Calculate user time out parameters */
            I2CInTOTcnt = pSalI2CHND->TimeOut;
            if ((I2CInTOTcnt != 0) && (I2CInTOTcnt != I2C_TIMEOOUT_ENDLESS)) {
                InTimeoutCount = (I2CInTOTcnt*1000/TIMER_TICK_US);
                InStartCount = HalTimerOp.HalTimerReadCount(1);
            }
            
            /* I2C Device Status Update */
            pSalI2CHND->DevSts  = I2C_STS_TX_READY;
            
            /* Send data till the TX buffer data length is zero */
            for (;pSalI2CHND->pTXBuf->DataLen>0;) {
                /* I2C Device Status Update */
                pSalI2CHND->DevSts  = I2C_STS_TX_ING;
                
                /* Check I2C RD Request flag */
                if ((pHalI2COP->HalI2CReadReg(pHalI2CInitDat, REG_DW_I2C_IC_RAW_INTR_STAT))
                        & BIT_IC_RAW_INTR_STAT_RD_REQ) {
                        
                    /* Check I2C TX FIFO status */
                    if ((pHalI2COP->HalI2CReadReg(pHalI2CInitDat, REG_DW_I2C_IC_STATUS)
                            & (BIT_IC_STATUS_TFNF)) == BIT_IC_STATUS_TFNF) {
                        pHalI2CInitDat->I2CDataLen= 1;
                        pHalI2CInitDat->I2CRWData = pSalI2CHND->pTXBuf->pDataBuf;
                        pHalI2COP->HalI2CMassSend(pHalI2CInitDat);
                        pHalI2CInitDat->I2CIntrClr = REG_DW_I2C_IC_CLR_RD_REQ;
                        pHalI2COP->HalI2CClrIntr(pHalI2CInitDat);
                        pSalI2CHND->pTXBuf->pDataBuf++;
                        pSalI2CHND->pTXBuf->DataLen--;
                    }
                }
                else {
                    /* Time-Out check */
                    if (InTimeoutCount > 0) {
                        if (HAL_TIMEOUT == I2CIsTimeout(InStartCount, InTimeoutCount)) {
                            pSalI2CHND->DevSts  = I2C_STS_TIMEOUT;
                            pSalI2CHND->ErrType = I2C_ERR_TX_FF_TO;
                            DBG_I2C_ERR("RtkI2CSend Timeout, I2C%2x,9\n",pSalI2CHND->DevNum);
                            DBG_I2C_ERR("DevSts:%x, ErrType:%x\n", pSalI2CHND->DevSts, pSalI2CHND->ErrType);
                            if (pSalI2CUserCB->pERRCB->USERCB != NULL)
                                    pSalI2CUserCB->pERRCB->USERCB((void *)pSalI2CUserCB->pERRCB->USERData);
                            return HAL_TIMEOUT;
                        }
                    }
                    else {
                        if (I2CInTOTcnt == 0) {
                            pSalI2CHND->DevSts  = I2C_STS_TIMEOUT;
                            pSalI2CHND->ErrType = I2C_ERR_TX_FF_TO;
                            DBG_I2C_ERR("RtkI2CSend Timeout, I2C%2x,10\n",pSalI2CHND->DevNum);
                            DBG_I2C_ERR("DevSts:%x, ErrType:%x\n", pSalI2CHND->DevSts, pSalI2CHND->ErrType);
                            if (pSalI2CUserCB->pERRCB->USERCB != NULL)
                                    pSalI2CUserCB->pERRCB->USERCB((void *)pSalI2CUserCB->pERRCB->USERData);
                            return HAL_TIMEOUT;
                        }
                    }
                }               
            }

            /* I2C Device Status Update */
            pSalI2CHND->DevSts  = I2C_STS_IDLE;
        }
        /* #if I2C_POLL_OP_TYPE */

        /* #if I2C_INTR_OP_TYPE */
        if (pSalI2CHND->OpType == I2C_INTR_TYPE) {
            /* I2C Device Status Update */
            pSalI2CHND->DevSts = I2C_STS_IDLE;
#if 0
            pHalI2CInitDat->I2CIntrClr = REG_DW_I2C_IC_CLR_TX_ABRT;
            pHalI2COP->HalI2CClrIntr(pHalI2CInitDat);
            pHalI2CInitDat->I2CIntrClr = REG_DW_I2C_IC_CLR_TX_OVER;
            pHalI2COP->HalI2CClrIntr(pHalI2CInitDat);
            pHalI2CInitDat->I2CIntrClr = REG_DW_I2C_IC_CLR_RD_REQ;
            pHalI2COP->HalI2CClrIntr(pHalI2CInitDat);
            pHalI2CInitDat->I2CIntrClr = REG_DW_I2C_IC_CLR_ACTIVITY;
            pHalI2COP->HalI2CClrIntr(pHalI2CInitDat);
            pHalI2COP->HalI2CClrAllIntr(pHalI2CInitDat);
#endif
            pSalI2CHND->DevSts  = I2C_STS_TX_READY;
            
            /* I2C Enable TX Related Interrupts. In Slave-Transmitter, the below 
                    interrupts should be enabled. */
            I2CLocalTemp = pHalI2COP->HalI2CReadReg(pHalI2CInitDat, REG_DW_I2C_IC_INTR_MASK);
            I2CLocalTemp |= (BIT_IC_INTR_MASK_M_TX_ABRT |
                             BIT_IC_INTR_MASK_M_TX_OVER |
                             BIT_IC_INTR_MASK_M_RX_DONE |
                             BIT_IC_INTR_MASK_M_RD_REQ);
            pHalI2CInitDat->I2CIntrMSK = I2CLocalTemp;
            pHalI2COP->HalI2CIntrCtrl(pHalI2CInitDat);
        }
        /* #if I2C_INTR_OP_TYPE */

        /* #if I2C_DMA_OP_TYPE */
            ;
        /* #if I2C_DMA_OP_TYPE */
    }

    return HAL_OK;
}

//---------------------------------------------------------------------------------------------------
//Function Name:
//		RtkI2CReceive
//
// Description:
//         To execute Master-Receiver and Slave-Receiver operation.
//         There are 3 operation mode in this function which are separated by compile-time
//         flag.
//         For Master-Receiver, the User Register Address flag is checked first.
//         User Register Address may be sent before any formal transfer, no matter in
//         Poll-, Intr- or DMA- Mode.
//
//         For Master-Receiver, the I2C master have to send a Read Command for receiving 
//         one byte from the other I2C slave. 
//
//         In Poll-Mode, no matter it's master or slave mode, the transfer will be done in 
//         this function by checking the transfer length.
//              -Master in Poll-Mode: 
//                a. Send the User Register Address if needed.
//                b. Check if all the data are received. If it's NOT, checking the TX FIFO
//                    status will be done. If the TX FIFO it's full, a Read Command will be
//                    wirtten into the TX FIFO.
//                c. After b, the I2C master contineously polls the RX FIFO status to see
//                   if there is a received data. If it received one, it will move the data from
//                   I2C RX FIFO into user RX data buffer.
//                d. b and c are executed circularly till the RX buffer data length is zero.
//
//              -Slave in Poll-Mode: 
//                a. Check if all the data are received.
//                b. The I2C slave contineously polls the RX FIFO status to see
//                    if there is a received data. If it received one, it will move the data from
//                    I2C RX FIFO into user RX data buffer.
//                c. a and b are executed circularly till the RX buffer data length is zero.
//
//----------------------------------------------------------------------
//         In Intr-Mode, this function is used to unmask the realted I2C interrupt for 
//         the following interrupt operations.
//              -Master in Intr-Mode:
//                a. Send the User Register Address if needed.
//                b. Unmask the RX-Full and realted error interrupts.
//                c. Write one or two Read Command into master TX FIFO for requesting 
//                   another slave providing data.
//
//              -Slave in Intr-Mode:
//                a. Unmask the RX-Full and realted error interrupts.
//
// Arguments:
//		[in] VOID *Data -
//			I2C SAL handle
//
// Return:
//		The status of the I2C receive process.
//          _EXIT_SUCCESS if the RtkI2CReceive succeeded.
//          _EXIT_FAILURE if the RtkI2CReceive failed.
//
// Note:
//		NA
//
// See Also:
//		NA
//
// Author:
// 		By Jason Deng, 2014-04-03.
//
//----------------------------------------------------------------------------------------------------
HAL_Status
RtkI2CReceive_Patch(
    IN  VOID *Data
){
    PSAL_I2C_HND        pSalI2CHND          = (PSAL_I2C_HND) Data;
    PSAL_I2C_HND_PRIV   pSalI2CHNDPriv      = NULL;
    PSAL_I2C_MNGT_ADPT  pSalI2CMngtAdpt     = NULL;
    PHAL_I2C_INIT_DAT   pHalI2CInitDat      = NULL;
    PHAL_I2C_OP         pHalI2COP           = NULL;   
#if I2C_DMA_OP_TYPE
    PHAL_GDMA_ADAPTER   pHalI2CRxGdmaAdpt   = NULL;
    PHAL_GDMA_OP        pHalI2CGdmaOp       = NULL;
#endif
    PSAL_I2C_USER_CB    pSalI2CUserCB       = NULL;
    
    u32 I2CLocalTemp = 0;
    u32 I2CInTOTcnt = 0;
    u32 InTimeoutCount = 0;
    u32 InStartCount = 0;
    u32 I2CLocalLen = 0;
    u32 I2CChkRawSts = 0;
    u32 I2CChkRawSts2 = 0;
    u32 I2CDataLenBak = 0;
    u32 I2CDataPtrBak = 0;
    u32 I2CInTOTcntRty      = 0;
    u32 InTimeoutCountRty   = 0;
    u32 InStartCountRty     = 0;
    //u32 I2CInTOTcntIntr = 0;
    //u32 InTimeoutCountIntr = 0;
    //u32 InStartCountIntr = 0;
    u32 I2CMtrTtyCnt    = 0;
    
    /*To Get the SAL_I2C_MNGT_ADPT Pointer*/
    pSalI2CHNDPriv  = CONTAINER_OF(pSalI2CHND, SAL_I2C_HND_PRIV, SalI2CHndPriv);
    pSalI2CMngtAdpt = CONTAINER_OF(pSalI2CHNDPriv->ppSalI2CHnd, SAL_I2C_MNGT_ADPT, pSalHndPriv);
    pHalI2CInitDat  = pSalI2CMngtAdpt->pHalInitDat;
    pHalI2COP       = pSalI2CMngtAdpt->pHalOp;
    pSalI2CUserCB   = pSalI2CHND->pUserCB;
#if I2C_DMA_OP_TYPE
    pHalI2CRxGdmaAdpt   = pSalI2CMngtAdpt->pHalRxGdmaAdp;
    pHalI2CGdmaOp       = pSalI2CMngtAdpt->pHalGdmaOp;
#endif
    
    if (pSalI2CHND->I2CMaster == I2C_MASTER_MODE)/*if (pSalI2CHND->I2CMaster == I2C_MASTER_MODE)*/
    {
        I2CMtrTtyCnt = 0;
        /* Master run-time update  target address */
        if (pSalI2CHND->I2CExd & I2C_EXD_MTR_ADDR_UPD) {
            /* Calculate user time out parameters */
            I2CInTOTcnt = pSalI2CHND->TimeOut;
            if ((I2CInTOTcnt != 0) && (I2CInTOTcnt != I2C_TIMEOOUT_ENDLESS)) {
                InTimeoutCount = (I2CInTOTcnt*1000/TIMER_TICK_US);
                InStartCount = HalTimerOp.HalTimerReadCount(1);
            }
            
            /* Check Master activity status */
            while ((pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_STATUS)) & BIT_IC_STATUS_MST_ACTIVITY) {  
                pHalI2COP->HalI2CClrAllIntr(pHalI2CInitDat);
                /* Time-Out check */
                if (InTimeoutCount > 0) {
                    if (HAL_TIMEOUT == I2CIsTimeout(InStartCount, InTimeoutCount)) {
                        pSalI2CHND->DevSts  = I2C_STS_TIMEOUT;
                        pSalI2CHND->ErrType = I2C_ERR_RX_ADD_TO;
                        DBG_I2C_ERR("RtkI2CReceive Timeout, I2C%2x,1\n",pSalI2CHND->DevNum);
                        DBG_I2C_ERR("DevSts:%x, ErrType:%x\n", pSalI2CHND->DevSts, pSalI2CHND->ErrType);
                        if (pSalI2CUserCB->pERRCB->USERCB != NULL)
                                    pSalI2CUserCB->pERRCB->USERCB((void *)pSalI2CUserCB->pERRCB->USERData);
                        return HAL_TIMEOUT;
                    }
                }
                else {
                    if (I2CInTOTcnt == 0) {
                        pSalI2CHND->DevSts  = I2C_STS_TIMEOUT;
                        pSalI2CHND->ErrType = I2C_ERR_RX_ADD_TO;
                        DBG_I2C_ERR("RtkI2CReceive Timeout, I2C%2x,2\n",pSalI2CHND->DevNum);
                        DBG_I2C_ERR("DevSts:%x, ErrType:%x\n", pSalI2CHND->DevSts, pSalI2CHND->ErrType);
                        if (pSalI2CUserCB->pERRCB->USERCB != NULL)
                                    pSalI2CUserCB->pERRCB->USERCB((void *)pSalI2CUserCB->pERRCB->USERData);
                        return HAL_TIMEOUT;
                    }
                }
            }

            /* Calculate user time out parameters */
            I2CInTOTcnt = pSalI2CHND->TimeOut;
            if ((I2CInTOTcnt != 0) && (I2CInTOTcnt != I2C_TIMEOOUT_ENDLESS)) {
                InTimeoutCount = (I2CInTOTcnt*1000/TIMER_TICK_US);
                InStartCount = HalTimerOp.HalTimerReadCount(1);
            }

            /* Check TX FIFO status */
            while (!((pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_STATUS)) & BIT_IC_STATUS_TFE)) {                
                /* Time-Out check */
                if (InTimeoutCount > 0) {
                    if (HAL_TIMEOUT == I2CIsTimeout(InStartCount, InTimeoutCount)) {
                        pSalI2CHND->DevSts  = I2C_STS_TIMEOUT;
                        pSalI2CHND->ErrType = I2C_ERR_RX_ADD_TO;
                        DBG_I2C_ERR("RtkI2CReceive Timeout, I2C%2x,3\n",pSalI2CHND->DevNum);
                        DBG_I2C_ERR("DevSts:%x, ErrType:%x\n", pSalI2CHND->DevSts, pSalI2CHND->ErrType);
                        if (pSalI2CUserCB->pERRCB->USERCB != NULL)
                                    pSalI2CUserCB->pERRCB->USERCB((void *)pSalI2CUserCB->pERRCB->USERData);
                        return HAL_TIMEOUT;
                    }
                }
                else {
                    if (I2CInTOTcnt == 0) {
                        pSalI2CHND->DevSts  = I2C_STS_TIMEOUT;
                        pSalI2CHND->ErrType = I2C_ERR_RX_ADD_TO;
                        DBG_I2C_ERR("RtkI2CReceive Timeout, I2C%2x,4\n",pSalI2CHND->DevNum);
                        DBG_I2C_ERR("DevSts:%x, ErrType:%x\n", pSalI2CHND->DevSts, pSalI2CHND->ErrType);
                        if (pSalI2CUserCB->pERRCB->USERCB != NULL)
                                    pSalI2CUserCB->pERRCB->USERCB((void *)pSalI2CUserCB->pERRCB->USERData);
                        return HAL_TIMEOUT;
                    }
                }
            }

