alibaba/AliOS-Things/platform/mcu/rtl8710bn/sdk/component/soc/realtek/8195a/fwlib/src/hal_i2c.c
            I2CLocalTemp = pHalI2COP->HalI2CReadReg(pHalI2CInitDat, REG_DW_I2C_IC_TAR);
            I2CLocalTemp &= (~BIT_MASK_IC_TAR);
            I2CLocalTemp |= BIT_CTRL_IC_TAR(pSalI2CHND->pRXBuf->TargetAddr);
            /* Update Master Target address */
            pHalI2COP->HalI2CWriteReg(pHalI2CInitDat, REG_DW_I2C_IC_TAR, I2CLocalTemp);
        }


#if I2C_USER_REG_ADDR   /*I2C_USER_REG_ADDR*/ 
        RtkI2CSendUserAddr(pSalI2CHND, 1);        
#endif                  /*I2C_USER_REG_ADDR*/

#if I2C_POLL_OP_TYPE/*I2C_POLL_OP_TYPE*/
        if (pSalI2CHND->OpType == I2C_POLL_TYPE)
        {
            /* I2C Device Status Update */
            pSalI2CHND->DevSts  = I2C_STS_RX_READY;
            
            pSalI2CMngtAdpt->MstRDCmdCnt = pSalI2CHND->pRXBuf->DataLen;
            I2CLocalTemp = pSalI2CHND->pRXBuf->DataLen;
            
            /* Calculate user time out parameters */
            I2CInTOTcnt = pSalI2CHND->TimeOut;
            if ((I2CInTOTcnt != 0) && (I2CInTOTcnt != I2C_TIMEOOUT_ENDLESS)) {
                InTimeoutCount = (I2CInTOTcnt*1000/TIMER_TICK_US);
                InStartCount = HalTimerOp.HalTimerReadCount(1);
            }
            
            /* Receive data till the RX buffer data length is zero */
            for ( ;pSalI2CHND->pRXBuf->DataLen>0; ) {
SEND_I2C_RD_CMD:
                /* I2C Device Status Update */
                pSalI2CHND->DevSts  = I2C_STS_RX_ING;
                /* Check I2C TX FIFO status. If it's NOT full, a Read command is written
                            into the TX FIFO.*/
                if (pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_STATUS)
                        & BIT_IC_STATUS_TFNF) {
                    if (pSalI2CMngtAdpt->MstRDCmdCnt > 0) {
                        pHalI2CInitDat->I2CCmd    = I2C_READ_CMD;
                        pHalI2CInitDat->I2CDataLen= 1;
                        pHalI2CInitDat->I2CRWData = pSalI2CHND->pRXBuf->pDataBuf;
                        pHalI2CInitDat->I2CStop   = I2C_STOP_DIS;
                        if ((pSalI2CMngtAdpt->MstRDCmdCnt == 1) && ((pSalI2CHND->I2CExd & I2C_EXD_MTR_HOLD_BUS) == 0)){
                            pHalI2CInitDat->I2CStop   = I2C_STOP_EN; 
                        }
                        pHalI2COP->HalI2CMassSend(pHalI2CInitDat);
                        if (pSalI2CMngtAdpt->MstRDCmdCnt > 0)
                            pSalI2CMngtAdpt->MstRDCmdCnt--;
                    }                    
                }

                if (I2CLocalTemp == pSalI2CHND->pRXBuf->DataLen){
                  if (pSalI2CHND->I2CExd & I2C_EXD_MTR_ADDR_RTY) {
                        HalDelayUs(((1000*30)/pHalI2CInitDat->I2CClk));    //the 10 is for ten bit time      
                        I2CChkRawSts = pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_RAW_INTR_STAT);
                        if (I2CChkRawSts & BIT_IC_RAW_INTR_STAT_TX_ABRT) {
                            I2CMtrTtyCnt++;
                            I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_TX_ABRT_SOURCE);
    	                    if (I2CMtrTtyCnt > I2C_MTR_RTY_CNT) {
                                if ((I2CChkRawSts & (BIT_IC_TX_ABRT_SOURCE_ABRT_7B_ADDR_NOACK | 
                                              BIT_IC_TX_ABRT_SOURCE_ABRT_10ADDR1_NOACK |
                                              BIT_IC_TX_ABRT_SOURCE_ABRT_10ADDR2_NOACK)) != 0) {
                                    pSalI2CHND->ErrType |= I2C_ERR_MST_A_NACK;
                                }
                                else if ((I2CChkRawSts & BIT_IC_TX_ABRT_SOURCE_ABRT_TXDATA_NOACK) != 0){
                                    pSalI2CHND->ErrType |= I2C_ERR_MST_D_NACK;
                                }
                                else {
                                    pSalI2CHND->ErrType |= I2C_ERR_TX_ABRT;
                                }
                                pSalI2CHND->DevSts  = I2C_STS_ERROR;
                                if (pSalI2CUserCB->pERRCB->USERCB != NULL)
                                    pSalI2CUserCB->pERRCB->USERCB((void *)pSalI2CUserCB->pERRCB->USERData);
                                return HAL_ERR_HW;
    	                    }
                            pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_CLR_TX_ABRT); 
                            pSalI2CMngtAdpt->MstRDCmdCnt++;
                            goto SEND_I2C_RD_CMD;
                        }
                  }                    
                }
                               
                /* Contineously poll the I2C RX FIFO status */
                while (1) {
                    if ((pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_STATUS)
                        & (BIT_IC_STATUS_RFNE | BIT_IC_STATUS_RFF)) != 0) {
                        *(pSalI2CHND->pRXBuf->pDataBuf) = 
                                        pHalI2COP->HalI2CReceive(pHalI2CInitDat);
                        
                        pSalI2CHND->pRXBuf->pDataBuf++;
                        pSalI2CHND->pRXBuf->DataLen--;

                        if (!pSalI2CHND->pRXBuf->DataLen) {
                            break;
                        }
                    }
                    else {
                        break;
                    }
                }

                /* Time-Out check */
                if (InTimeoutCount > 0) {
                    if (HAL_TIMEOUT == I2CIsTimeout(InStartCount, InTimeoutCount)) {
                        pSalI2CHND->DevSts  = I2C_STS_TIMEOUT;
                        pSalI2CHND->ErrType = I2C_ERR_RX_FF_TO;
                        DBG_I2C_ERR("RtkI2CReceive Timeout, I2C%2x,5\n",pSalI2CHND->DevNum);
                        DBG_I2C_ERR("DevSts:%x, ErrType:%x\n", pSalI2CHND->DevSts, pSalI2CHND->ErrType);
                        if (pSalI2CUserCB->pERRCB->USERCB != NULL)
                                    pSalI2CUserCB->pERRCB->USERCB((void *)pSalI2CUserCB->pERRCB->USERData);
                        return HAL_TIMEOUT;
                    }
                }
                else {
                    if (I2CInTOTcnt == 0) {
                        pSalI2CHND->DevSts  = I2C_STS_TIMEOUT;
                        pSalI2CHND->ErrType = I2C_ERR_RX_FF_TO;
                        DBG_I2C_ERR("RtkI2CReceive Timeout, I2C%2x,6\n",pSalI2CHND->DevNum);
                        DBG_I2C_ERR("DevSts:%x, ErrType:%x\n", pSalI2CHND->DevSts, pSalI2CHND->ErrType);
                        if (pSalI2CUserCB->pERRCB->USERCB != NULL)
                                    pSalI2CUserCB->pERRCB->USERCB((void *)pSalI2CUserCB->pERRCB->USERData);
                        return HAL_TIMEOUT;
                    }
                }

