alibaba/AliOS-Things/platform/mcu/rtl8710bn/sdk/component/soc/realtek/8195a/fwlib/src/hal_i2c.c
            }   

            /* I2C Device Status Update */
            pSalI2CHND->DevSts = I2C_STS_IDLE;
        }       
#endif/*I2C_POLL_OP_TYPE*/    

#if I2C_INTR_OP_TYPE/*I2C_INTR_OP_TYPE*/
        if (pSalI2CHND->OpType == I2C_INTR_TYPE) {
            /* Calculate user time out parameters */
            InTimeoutCount= 0;
            InStartCount  = 0;
            I2CInTOTcnt = pSalI2CMngtAdpt->InnerTimeOut;

            //InTimeoutCountIntr = 0;
            //InStartCountIntr = 0;            
            //I2CInTOTcntIntr = pSalI2CHND->AddRtyTimeOut;
            
            if ((I2CInTOTcnt!= 0) && (I2CInTOTcnt!= I2C_TIMEOOUT_ENDLESS)) {
                InTimeoutCount = (I2CInTOTcnt*1000/TIMER_TICK_US);
                InStartCount= HalTimerOp.HalTimerReadCount(1);
            }

            //InTimeoutCountIntr = (I2CInTOTcntIntr*1000/TIMER_TICK_US);
            //InStartCountIntr = HalTimerOp.HalTimerReadCount(1);
            
            I2CDataLenBak = (u32)(pSalI2CHND->pRXBuf->DataLen);
            I2CDataPtrBak = (u32)(pSalI2CHND->pRXBuf->pDataBuf);
            
            /* I2C Device Status Update */
            pSalI2CHND->DevSts = I2C_STS_RX_READY;
            pHalI2CInitDat->I2CIntrClr = REG_DW_I2C_IC_CLR_TX_ABRT;
            pHalI2COP->HalI2CClrIntr(pHalI2CInitDat);
            pHalI2CInitDat->I2CIntrClr = REG_DW_I2C_IC_CLR_ACTIVITY;
            pHalI2COP->HalI2CClrIntr(pHalI2CInitDat);
            pHalI2COP->HalI2CClrAllIntr(pHalI2CInitDat);

            /* Clear RX FIFO */
            I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_RXFLR);
            while (I2CChkRawSts > 0){
                I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_RXFLR);
            }
            
            /* To fill the Master Read Command into TX FIFO */
            pSalI2CMngtAdpt->MstRDCmdCnt = pSalI2CHND->pRXBuf->DataLen;
            I2CLocalLen = 2;//pSalI2CHND->pRXBuf->DataLen;
            pSalI2CHND->DevSts = I2C_STS_RX_READY;

            
            while (1) {
SEND_I2C_RD_CMD_INTR:
                
                /* Calculate user time out parameters */
    			InTimeoutCountRty   = 0;
    			InStartCountRty     = 0;
                I2CInTOTcntRty      = pSalI2CHND->TimeOut;          
                
                if ((I2CInTOTcntRty != 0) && (I2CInTOTcntRty!= I2C_TIMEOOUT_ENDLESS)) {
                    InTimeoutCountRty= (I2CInTOTcntRty*1000/TIMER_TICK_US);
                    InStartCountRty= HalTimerOp.HalTimerReadCount(1);
                }
                I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_STATUS);

                if ((pSalI2CMngtAdpt->MstRDCmdCnt > 0) && (I2CLocalLen > 0)){
                    pHalI2CInitDat->I2CCmd    = I2C_READ_CMD;
                    pHalI2CInitDat->I2CDataLen= 1;
                    pHalI2CInitDat->I2CRWData = pSalI2CHND->pRXBuf->pDataBuf;
                    pHalI2CInitDat->I2CStop   = I2C_STOP_DIS;

                    if ((pSalI2CMngtAdpt->MstRDCmdCnt == 1) && ((pSalI2CHND->I2CExd & I2C_EXD_MTR_HOLD_BUS) == 0)){
                        pHalI2CInitDat->I2CStop   = I2C_STOP_EN;
                    }

                    if ((pHalI2CInitDat->I2CReSTR == 1) && (I2CLocalLen == 2)) {
                        pHalI2CInitDat->RSVD0 |= BIT0;
                    }
                    
                    pHalI2COP->HalI2CMassSend(pHalI2CInitDat);               

                    if ((pHalI2CInitDat->I2CReSTR == 1) && (I2CLocalLen == 2)) {
                        pHalI2CInitDat->RSVD0 &= (~BIT0);
                    }
                }                  

                if (pSalI2CHND->I2CExd & I2C_EXD_MTR_ADDR_RTY) {

                    /* SEND_I2C_WR_CMD_INTR Time-Out check */
                    //if (InTimeoutCountIntr > 0) {
                    //    if (HAL_TIMEOUT == I2CIsTimeout(InStartCountIntr, InTimeoutCountIntr)) {
                    //        return HAL_TIMEOUT;
                    //    }
                    //}
                    
                    I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_STATUS);
                    while ((I2CChkRawSts & BIT_IC_STATUS_TFE) == 0) {
                        I2CChkRawSts2 = pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_RAW_INTR_STAT);
                        if ((I2CChkRawSts2 & BIT_IC_RAW_INTR_STAT_TX_ABRT) != 0){
                            break;
                        }

                        /* Time-Out check */
                        if (InTimeoutCountRty > 0) {
                            if (HAL_TIMEOUT == I2CIsTimeout(InStartCountRty, InTimeoutCountRty)) {
                                break;
                            }
                        }
                        else {
                            if (I2CInTOTcntRty == 0) {
                                break;
                            }
                        }
                        I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_STATUS);
                        
                    }
                    
                    HalDelayUs(((1000*30)/pHalI2CInitDat->I2CClk));    //the 10 is for ten bit time
                    
                    I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_RAW_INTR_STAT);
                    I2CChkRawSts2 = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_STATUS);
	                if (I2CChkRawSts & BIT_IC_RAW_INTR_STAT_TX_ABRT) {
                        I2CMtrTtyCnt++;
	                    I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_TX_ABRT_SOURCE);
	                    if (I2CMtrTtyCnt > I2C_MTR_RTY_CNT) {
                            if ((I2CChkRawSts & (BIT_IC_TX_ABRT_SOURCE_ABRT_7B_ADDR_NOACK | 
                                              BIT_IC_TX_ABRT_SOURCE_ABRT_10ADDR1_NOACK |
                                              BIT_IC_TX_ABRT_SOURCE_ABRT_10ADDR2_NOACK)) != 0) {
                                pSalI2CHND->ErrType |= I2C_ERR_MST_A_NACK;
                            }
                            else if ((I2CChkRawSts & BIT_IC_TX_ABRT_SOURCE_ABRT_TXDATA_NOACK) != 0){
                                pSalI2CHND->ErrType |= I2C_ERR_MST_D_NACK;
                            }
                            else {
                                pSalI2CHND->ErrType |= I2C_ERR_TX_ABRT;
                            }

                            pSalI2CHND->DevSts  = I2C_STS_ERROR;
                            if (pSalI2CUserCB->pERRCB->USERCB != NULL)
                                pSalI2CUserCB->pERRCB->USERCB((void *)pSalI2CUserCB->pERRCB->USERData);
                            return HAL_ERR_HW;
	                    }
                        
	                    /* use InTimeoutCount to backup tar here */
                        InTimeoutCount = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat, REG_DW_I2C_IC_TAR);
                        InTimeoutCount = BIT_GET_IC_TAR(InTimeoutCount);
                        
