alibaba/AliOS-Things/platform/mcu/rtl8710bn/sdk/component/soc/realtek/8195a/fwlib/src/hal_i2c.c
                        RtkI2CDeInitForPS(pSalI2CHND);
                        I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_ENABLE_STATUS);
                        while((I2CChkRawSts & BIT_IC_ENABLE_STATUS_IC_EN) == BIT_IC_ENABLE_STATUS_IC_EN){
                            I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_ENABLE_STATUS);
                        }

                        
                        
                        RtkI2CInitForPS(pSalI2CHND);

                        pSalI2CHND->pInitDat->I2CAckAddr = InTimeoutCount;
                        HalI2CSetTarRtl8195a(pSalI2CHND->pInitDat);

                        I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_ENABLE_STATUS);
                        while((I2CChkRawSts & BIT_IC_ENABLE_STATUS_IC_EN) != BIT_IC_ENABLE_STATUS_IC_EN){
                            I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_ENABLE_STATUS);
                        }
                        pSalI2CHND->DevSts  = I2C_STS_RX_READY;
                        pSalI2CHND->ErrType = 0;
                        pSalI2CHND->pRXBuf->DataLen = (u16)I2CDataLenBak;
                        pSalI2CHND->pRXBuf->pDataBuf= (u8 *)I2CDataPtrBak;

                        /* Calculate user time out parameters */
                        InTimeoutCount  = 0;
                        InStartCount    = 0;
                        I2CInTOTcnt = pSalI2CMngtAdpt->InnerTimeOut;
                        if ((I2CInTOTcnt != 0) && (I2CInTOTcnt != I2C_TIMEOOUT_ENDLESS)) {
                            InTimeoutCount = (I2CInTOTcnt*1000/TIMER_TICK_US);
                            InStartCount = HalTimerOp.HalTimerReadCount(1);
                        }
                        goto SEND_I2C_RD_CMD_INTR;
                    }
                    else if ((I2CChkRawSts2 & BIT_IC_STATUS_TFE) != BIT_IC_STATUS_TFE){
                        I2CMtrTtyCnt++;
	                    I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_TX_ABRT_SOURCE);
	                    if (I2CMtrTtyCnt > I2C_MTR_RTY_CNT) {
                            if ((I2CChkRawSts & (BIT_IC_TX_ABRT_SOURCE_ABRT_7B_ADDR_NOACK | 
                                              BIT_IC_TX_ABRT_SOURCE_ABRT_10ADDR1_NOACK |
                                              BIT_IC_TX_ABRT_SOURCE_ABRT_10ADDR2_NOACK)) != 0) {
                                pSalI2CHND->ErrType |= I2C_ERR_MST_A_NACK;
                            }
                            else if ((I2CChkRawSts & BIT_IC_TX_ABRT_SOURCE_ABRT_TXDATA_NOACK) != 0){
                                pSalI2CHND->ErrType |= I2C_ERR_MST_D_NACK;
                            }
                            else {
                                pSalI2CHND->ErrType |= I2C_ERR_TX_ABRT;
                            }
                            pSalI2CHND->DevSts  = I2C_STS_ERROR;
                            if (pSalI2CUserCB->pERRCB->USERCB != NULL)
                                pSalI2CUserCB->pERRCB->USERCB((void *)pSalI2CUserCB->pERRCB->USERData);
                            return HAL_ERR_HW;
	                    }

                        /* use InTimeoutCount to backup tar here */
                        InTimeoutCount = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat, REG_DW_I2C_IC_TAR);
                        InTimeoutCount = BIT_GET_IC_TAR(InTimeoutCount);
                        
                        RtkI2CDeInitForPS(pSalI2CHND);
                        I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_ENABLE_STATUS);
                        while((I2CChkRawSts & BIT_IC_ENABLE_STATUS_IC_EN) == BIT_IC_ENABLE_STATUS_IC_EN){
                            I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_ENABLE_STATUS);
                        }

                        
                        
                        RtkI2CInitForPS(pSalI2CHND);

                        pSalI2CHND->pInitDat->I2CAckAddr = InTimeoutCount;
                        HalI2CSetTarRtl8195a(pSalI2CHND->pInitDat);

                        I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_ENABLE_STATUS);
                        while((I2CChkRawSts & BIT_IC_ENABLE_STATUS_IC_EN) != BIT_IC_ENABLE_STATUS_IC_EN){
                            I2CChkRawSts = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_ENABLE_STATUS);
                        }
                        pSalI2CHND->DevSts  = I2C_STS_RX_READY;
                        pSalI2CHND->ErrType = 0;
                        pSalI2CHND->pRXBuf->DataLen = (u16)I2CDataLenBak;
                        pSalI2CHND->pRXBuf->pDataBuf= (u8 *)I2CDataPtrBak;

                        /* Calculate user time out parameters */
                        InTimeoutCount  = 0;
                        InStartCount    = 0;
                        I2CInTOTcnt = pSalI2CMngtAdpt->InnerTimeOut;
                        if ((I2CInTOTcnt != 0) && (I2CInTOTcnt != I2C_TIMEOOUT_ENDLESS)) {
                            InTimeoutCount = (I2CInTOTcnt*1000/TIMER_TICK_US);
                            InStartCount = HalTimerOp.HalTimerReadCount(1);
                        }
                        goto SEND_I2C_RD_CMD_INTR;
                    }
                    else {
                        I2CChkRawSts2 = (u32)pHalI2COP->HalI2CReadReg(pHalI2CInitDat,REG_DW_I2C_IC_STATUS);
                        {
                            if (I2CLocalLen>0){
                                I2CLocalLen--;
                                pSalI2CMngtAdpt->MstRDCmdCnt --;
                            }
                        }
                    }
                }               
                else {
                    if (I2CLocalLen>0) {
                        I2CLocalLen--;  
                        pSalI2CMngtAdpt->MstRDCmdCnt --;
                    }
                }

                if ((I2CLocalLen == 0) || (pSalI2CHND->pRXBuf->DataLen == 1)){
                    pHalI2CInitDat->I2CIntrClr = REG_DW_I2C_IC_CLR_TX_ABRT;
                    pHalI2COP->HalI2CClrIntr(pHalI2CInitDat);
                    I2CLocalTemp = 0;
                    I2CLocalTemp = pHalI2COP->HalI2CReadReg(pHalI2CInitDat, REG_DW_I2C_IC_INTR_MASK);
                    I2CLocalTemp |= (BIT_IC_INTR_MASK_M_RX_FULL |
                                     BIT_IC_INTR_MASK_M_RX_OVER |
                                     BIT_IC_INTR_MASK_M_RX_UNDER|BIT_IC_INTR_MASK_M_TX_ABRT);
                    pHalI2CInitDat->I2CIntrMSK = I2CLocalTemp;
                    pHalI2COP->HalI2CIntrCtrl(pHalI2CInitDat);  
                    break;
                }

