alibaba/AliOS-Things/platform/mcu/rtl8710bn/sdk/component/soc/realtek/8195a/fwlib/src/hal_i2c.c
#if I2C_INTR_OP_TYPE/*I2C_INTR_OP_TYPE*/
        if (pSalI2CHND->OpType == I2C_INTR_TYPE) {
            pSalI2CHND->DevSts = I2C_STS_RX_READY;

            /*I2C Enable RX Related Interrupts*/
            I2CLocalTemp = pHalI2COP->HalI2CReadReg(pHalI2CInitDat, REG_DW_I2C_IC_INTR_MASK);
            I2CLocalTemp |= (BIT_IC_INTR_MASK_M_RX_FULL |
                             BIT_IC_INTR_MASK_M_RX_OVER |
                             BIT_IC_INTR_MASK_M_RX_UNDER);
            pHalI2CInitDat->I2CIntrMSK = I2CLocalTemp;
            pHalI2COP->HalI2CIntrCtrl(pHalI2CInitDat);
        }
#endif/*I2C_INTR_OP_TYPE*/

#if I2C_DMA_OP_TYPE/*I2C_INTR_OP_TYPE*/
        if (pSalI2CHND->OpType == I2C_DMA_TYPE) {
            pSalI2CHND->DevSts = I2C_STS_RX_READY;

            /*I2C Enable RX Related Interrupts*/
            I2CLocalTemp = pHalI2COP->HalI2CReadReg(pHalI2CInitDat, REG_DW_I2C_IC_INTR_MASK);
            I2CLocalTemp |= (BIT_IC_INTR_MASK_M_RX_OVER |
                             BIT_IC_INTR_MASK_M_RX_UNDER);
            pHalI2CInitDat->I2CIntrMSK = I2CLocalTemp;
            pHalI2COP->HalI2CIntrCtrl(pHalI2CInitDat);

            //HalGdmaOpInit(pHalI2CGdmaOp);
            pSalI2CMngtAdpt->pHalGdmaOpInit(pHalI2CGdmaOp);

            pHalI2CRxGdmaAdpt->GdmaCtl.BlockSize    = pSalI2CHND->pRXBuf->DataLen;
            pHalI2CRxGdmaAdpt->ChSar                = (u32)(I2C0_REG_BASE+REG_DW_I2C_IC_DATA_CMD+
                                                                pSalI2CHND->DevNum*0x400);
            pHalI2CRxGdmaAdpt->ChDar                = (u32)pSalI2CHND->pRXBuf->pDataBuf;

            pHalI2CGdmaOp->HalGdmaChSeting(pHalI2CRxGdmaAdpt);
            pHalI2CGdmaOp->HalGdmaChEn(pHalI2CRxGdmaAdpt);
            pSalI2CHND->DevSts  = I2C_STS_RX_ING;
            pHalI2CInitDat->I2CDMACtrl = BIT_CTRL_IC_DMA_CR_RDMAE(1);
            pHalI2COP->HalI2CDMACtrl(pHalI2CInitDat);            
        }
#endif/*I2C_INTR_OP_TYPE*/

    }
    
    return HAL_OK;
}



//---------------------------------------------------------------------------------------------------
//Function Name:
//		RtkI2CInitForPS
//
// Description:
//         Add power state registeration for I2C initail process.
//		
// Arguments:
//		[in] VOID *Data -
//			I2C SAL handle
//
// Return:
//		The status of the I2C initialization process.
//          HAL_OK if the RtkI2CInitForPS succeeded.
//          HAL_ERR_UNKNOWN if the RtkI2CInitForPS failed.
//
// Note:
//		NA
//
// See Also:
//		NA
//
// Author:
// 		By Jason Deng, 2015-05-31.
//
//----------------------------------------------------------------------------------------------------
HAL_Status
RtkI2CInitForPS(
    IN  VOID *Data
){

    u8 i2cInitSts = HAL_OK;
    PSAL_I2C_HND    pSalI2CHND  =   (PSAL_I2C_HND) Data;
#ifdef CONFIG_SOC_PS_MODULE
    REG_POWER_STATE i2cPwrState;
#endif

    /* Check the input I2C index first */
    if (FunctionChk((I2C0 + pSalI2CHND->DevNum), pSalI2CHND->PinMux) == _FALSE)
        return HAL_ERR_UNKNOWN;
        
    i2cInitSts = RtkI2CInit(pSalI2CHND);
    
#ifdef CONFIG_SOC_PS_MODULE
    // To register a new peripheral device power state
    if (i2cInitSts == HAL_OK){
        i2cPwrState.FuncIdx = I2C0 + pSalI2CHND->DevNum;
        i2cPwrState.PwrState = ACT;
        RegPowerState(i2cPwrState);
    }    
#endif

    return i2cInitSts;
}

//---------------------------------------------------------------------------------------------------
//Function Name:
//		RtkI2CDeInitForPS
//
// Description:
//         Add power state registeration for I2C deinitail process.
//		
// Arguments:
//		[in] VOID *Data -
//			I2C SAL handle
//
// Return:
//		The status of the I2C deinitialization process.
//          HAL_OK if the RtkI2CDeInitForPS succeeded.
//          HAL_ERR_UNKNOWN if the RtkI2CDeInitForPS failed.
//
// Note:
//		NA
//
// See Also:
//		NA
//
// Author:
// 		By Jason Deng, 2015-05-31.
//
//----------------------------------------------------------------------------------------------------
HAL_Status
RtkI2CDeInitForPS(
    IN  VOID *Data
){
    u8 i2cInitSts = HAL_OK;
    PSAL_I2C_HND    pSalI2CHND  =   (PSAL_I2C_HND) Data;
#ifdef CONFIG_SOC_PS_MODULE
    REG_POWER_STATE i2cPwrState;
    u8 HwState;
#endif

    if (pSalI2CHND == NULL)
        return HAL_ERR_UNKNOWN;
        
    /* Check the input I2C index first */
    if (RtkI2CIdxChk(pSalI2CHND->DevNum))
        return HAL_ERR_UNKNOWN;

#ifdef CONFIG_SOC_PS_MODULE
    i2cPwrState.FuncIdx = I2C0 + pSalI2CHND->DevNum;
        
    QueryRegPwrState(i2cPwrState.FuncIdx, &(i2cPwrState.PwrState), &HwState);
        
    // if the power state isn't ACT, then switch the power state back to ACT first
    if ((i2cPwrState.PwrState != ACT) && (i2cPwrState.PwrState != INACT)) {
        RtkI2CEnablePS(Data);
        QueryRegPwrState(i2cPwrState.FuncIdx, &(i2cPwrState.PwrState), &HwState);
    }

    if (i2cPwrState.PwrState == ACT) {
        i2cPwrState.PwrState = INACT;
        RegPowerState(i2cPwrState);
    }         
#endif

    i2cInitSts = RtkI2CDeInit(pSalI2CHND);

    return i2cInitSts;
}

//---------------------------------------------------------------------------------------------------
//Function Name:
//		RtkI2CDisablePS
//
// Description:
//         I2C disable opertion by setting clock disable.
//		
// Arguments:
//		[in] VOID *Data -
//			I2C SAL handle
//
// Return:
//		The status of the I2C disable process.
//          HAL_OK if the RtkI2CDisablePS succeeded.
//          HAL_ERR_PARA if the RtkI2CDisablePS failed.
//
// Note:
//		NA
//
// See Also:
//		NA
//
// Author:
// 		By Jason Deng, 2015-05-31.
//
//----------------------------------------------------------------------------------------------------
HAL_Status
RtkI2CDisablePS(
    IN  VOID *Data
){

    PSAL_I2C_HND    pSalI2CHND  =   (PSAL_I2C_HND) Data;
    u8 i2cIdx = pSalI2CHND->DevNum;
#ifdef CONFIG_SOC_PS_MODULE
    REG_POWER_STATE i2cPwrState;
#endif

    if (RtkI2CIdxChk(i2cIdx))
        return HAL_ERR_UNKNOWN;
        
    switch (i2cIdx) {
        case 0:
        {
            /* I2C 0 */
            ACTCK_I2C0_CCTRL(OFF);
            SLPCK_I2C0_CCTRL(OFF);
            break;
        }
        case 1:
        {
            /* I2C 1 */
            ACTCK_I2C1_CCTRL(OFF);
            SLPCK_I2C1_CCTRL(OFF);
            break;
        }
        case 2:
        {
            /* I2C 2 */
            ACTCK_I2C2_CCTRL(OFF);
            SLPCK_I2C2_CCTRL(OFF);
            break;
        }
        case 3:
        {
            /* I2C 3 */
            ACTCK_I2C3_CCTRL(OFF);
            SLPCK_I2C3_CCTRL(OFF);
            break;
        }
        default:
        {
            return HAL_ERR_PARA;
        }
    }

#ifdef CONFIG_SOC_PS_MODULE
    // To register a new peripheral device power state
    i2cPwrState.FuncIdx = I2C0 + pSalI2CHND->DevNum;
    i2cPwrState.PwrState = SLPCG;   
    RegPowerState(i2cPwrState);
#endif

    return HAL_OK;
}

//---------------------------------------------------------------------------------------------------
//Function Name:
//		RtkI2CEnablePS
//
// Description:
//         I2C enable opertion by setting clock enable.
//		
// Arguments:
//		[in] VOID *Data -
//			I2C SAL handle
//
// Return:
//		The status of the I2C enable process.
//          HAL_OK if the RtkI2CEnablePS succeeded.
//          HAL_ERR_PARA if the RtkI2CEnablePS failed.
//
// Note:
//		NA
//
// See Also:
//		NA
//
// Author:
// 		By Jason Deng, 2015-05-31.
//
//----------------------------------------------------------------------------------------------------
HAL_Status
RtkI2CEnablePS(
    IN  VOID *Data
){

    PSAL_I2C_HND    pSalI2CHND  =   (PSAL_I2C_HND) Data;
    u8 i2cIdx = pSalI2CHND->DevNum;
#ifdef CONFIG_SOC_PS_MODULE
    REG_POWER_STATE i2cPwrState;
#endif

    if (RtkI2CIdxChk(i2cIdx))
        return HAL_ERR_UNKNOWN;
        
    switch (i2cIdx) {
        case 0:
        {
            /* I2C 0 */
            ACTCK_I2C0_CCTRL(ON);
            SLPCK_I2C0_CCTRL(ON);
            break;
        }
        case 1:
        {
            /* I2C 1 */
            ACTCK_I2C1_CCTRL(ON);
            SLPCK_I2C1_CCTRL(ON);
            break;
        }
        case 2:
        {
            /* I2C 2 */
            ACTCK_I2C2_CCTRL(ON);
            SLPCK_I2C2_CCTRL(ON);
            break;
        }
        case 3:
        {
            /* I2C 3 */
            ACTCK_I2C3_CCTRL(ON);
            SLPCK_I2C3_CCTRL(ON);
            break;
        }
        default:
        {
            return HAL_ERR_PARA;
        }
    }

#ifdef CONFIG_SOC_PS_MODULE
    // To register a new peripheral device power state
    i2cPwrState.FuncIdx = I2C0 + pSalI2CHND->DevNum;
    i2cPwrState.PwrState = ACT;   
    RegPowerState(i2cPwrState);
#endif

    return HAL_OK;
}


#ifndef CONFIG_MBED_ENABLED
//---------------------------------------------------------------------------------------------------
//Function Name:
//		RtkI2CGetMngtAdpt
//
// Description:
//		According to the input index, all the memory space are allocated and all the 
//          related pointers are assigned. The management adapter pointer will be 
//          returned.
//
// Arguments:
//		[in] u8  I2CIdx -
//			I2C module index
//
// Return:
//		PSAL_I2C_MNGT_ADPT
//
// Note:
//		NA
//
// See Also:
//		NA
//
// Author:
// 		By Jason Deng, 2014-04-02.
//
//--------------------------------------------------------------------------------------------------- 
PSAL_I2C_MNGT_ADPT
RtkI2CGetMngtAdpt(
    IN  u8  I2CIdx
){
    PSAL_I2C_MNGT_ADPT      pSalI2CMngtAdpt     = NULL;
    PSAL_I2C_USERCB_ADPT    pSalI2CUserCBAdpt   = NULL;

    /* If the kernel is available, Memory-allocation is used. */
#ifndef I2C_STATIC_ALLOC

    pSalI2CMngtAdpt = (PSAL_I2C_MNGT_ADPT)RtlZmalloc(sizeof(SAL_I2C_MNGT_ADPT));
    pSalI2CMngtAdpt->pSalHndPriv    = (PSAL_I2C_HND_PRIV)RtlZmalloc(sizeof(SAL_I2C_HND_PRIV));
    pSalI2CMngtAdpt->pHalInitDat    = (PHAL_I2C_INIT_DAT)RtlZmalloc(sizeof(HAL_I2C_INIT_DAT));
    pSalI2CMngtAdpt->pHalOp         = (PHAL_I2C_OP)RtlZmalloc(sizeof(HAL_I2C_OP));
    pSalI2CMngtAdpt->pIrqHnd        = (PIRQ_HANDLE)RtlZmalloc(sizeof(IRQ_HANDLE));
    pSalI2CMngtAdpt->pHalTxGdmaAdp  = (PHAL_GDMA_ADAPTER)RtlZmalloc(sizeof(HAL_GDMA_ADAPTER));
    pSalI2CMngtAdpt->pHalRxGdmaAdp  = (PHAL_GDMA_ADAPTER)RtlZmalloc(sizeof(HAL_GDMA_ADAPTER));
    pSalI2CMngtAdpt->pHalGdmaOp     = (PHAL_GDMA_OP)RtlZmalloc(sizeof(HAL_GDMA_OP));
    pSalI2CMngtAdpt->pIrqTxGdmaHnd  = (PIRQ_HANDLE)RtlZmalloc(sizeof(IRQ_HANDLE));
    pSalI2CMngtAdpt->pIrqRxGdmaHnd  = (PIRQ_HANDLE)RtlZmalloc(sizeof(IRQ_HANDLE));
    pSalI2CMngtAdpt->pUserCB        = (PSAL_I2C_USER_CB)RtlZmalloc(sizeof(SAL_I2C_USER_CB));
    pSalI2CMngtAdpt->pDMAConf       = (PSAL_I2C_DMA_USER_DEF)RtlZmalloc(sizeof(SAL_I2C_DMA_USER_DEF));
    pSalI2CUserCBAdpt               = (PSAL_I2C_USERCB_ADPT)RtlZmalloc((sizeof(SAL_I2C_USERCB_ADPT)*SAL_USER_CB_NUM));
#else
    switch (I2CIdx){
        case I2C0_SEL:
        {
            pSalI2CMngtAdpt = &SalI2C0MngtAdpt;
            pSalI2CMngtAdpt->pSalHndPriv    = &SalI2C0HndPriv;
            pSalI2CMngtAdpt->pHalInitDat    = &HalI2C0InitData;
            pSalI2CMngtAdpt->pHalOp         = &HalI2COpSAL;
            pSalI2CMngtAdpt->pIrqHnd        = &I2C0IrqHandleDat;
            pSalI2CMngtAdpt->pHalTxGdmaAdp  = &HalI2C0TxGdmaAdpt;
            pSalI2CMngtAdpt->pHalRxGdmaAdp  = &HalI2C0RxGdmaAdpt;
            pSalI2CMngtAdpt->pHalGdmaOp     = &HalI2C0GdmaOp;
            pSalI2CMngtAdpt->pIrqTxGdmaHnd  = &I2C0TxGdmaIrqHandleDat;
            pSalI2CMngtAdpt->pIrqRxGdmaHnd  = &I2C0RxGdmaIrqHandleDat;
            pSalI2CMngtAdpt->pUserCB        = &SalI2C0UserCB;
            pSalI2CMngtAdpt->pDMAConf       = &SalI2C0DmaUserDef;
            pSalI2CUserCBAdpt               = (PSAL_I2C_USERCB_ADPT)&SalI2C0UserCBAdpt;
            break;
        }
        
        case I2C1_SEL:
        {
            pSalI2CMngtAdpt = &SalI2C1MngtAdpt;
            pSalI2CMngtAdpt->pSalHndPriv    = &SalI2C1HndPriv;
            pSalI2CMngtAdpt->pHalInitDat    = &HalI2C1InitData;
            pSalI2CMngtAdpt->pHalOp         = &HalI2COpSAL;
            pSalI2CMngtAdpt->pIrqHnd        = &I2C1IrqHandleDat;
            pSalI2CMngtAdpt->pHalTxGdmaAdp  = &HalI2C1TxGdmaAdpt;
            pSalI2CMngtAdpt->pHalRxGdmaAdp  = &HalI2C1RxGdmaAdpt;
            pSalI2CMngtAdpt->pHalGdmaOp     = &HalI2C1GdmaOp;
            pSalI2CMngtAdpt->pIrqTxGdmaHnd  = &I2C1TxGdmaIrqHandleDat;
            pSalI2CMngtAdpt->pIrqRxGdmaHnd  = &I2C1RxGdmaIrqHandleDat;
            pSalI2CMngtAdpt->pUserCB        = &SalI2C1UserCB;
            pSalI2CMngtAdpt->pDMAConf       = &SalI2C1DmaUserDef;
            pSalI2CUserCBAdpt               = (PSAL_I2C_USERCB_ADPT)&SalI2C1UserCBAdpt;
            break;
        }
        
