alibaba/AliOS-Things/platform/mcu/rtl8710bn/sdk/component/soc/realtek/8195a/fwlib/src/hal_i2c.c
        case I2C2_SEL:
        {
            pSalI2CMngtAdpt = &SalI2C2MngtAdpt;
            pSalI2CMngtAdpt->pSalHndPriv    = &SalI2C2HndPriv;
            pSalI2CMngtAdpt->pHalInitDat    = &HalI2C2InitData;
            pSalI2CMngtAdpt->pHalOp         = &HalI2COpSAL;
            pSalI2CMngtAdpt->pIrqHnd        = &I2C2IrqHandleDat;
            pSalI2CMngtAdpt->pHalTxGdmaAdp  = &HalI2C2TxGdmaAdpt;
            pSalI2CMngtAdpt->pHalRxGdmaAdp  = &HalI2C2RxGdmaAdpt;
            pSalI2CMngtAdpt->pHalGdmaOp     = &HalI2C2GdmaOp;
            pSalI2CMngtAdpt->pIrqTxGdmaHnd  = &I2C2TxGdmaIrqHandleDat;
            pSalI2CMngtAdpt->pIrqRxGdmaHnd  = &I2C2RxGdmaIrqHandleDat;
            pSalI2CMngtAdpt->pUserCB        = &SalI2C2UserCB;
            pSalI2CMngtAdpt->pDMAConf       = &SalI2C2DmaUserDef;
            pSalI2CUserCBAdpt               = (PSAL_I2C_USERCB_ADPT)&SalI2C2UserCBAdpt;
            break;
        }
        
        case I2C3_SEL:
        {
            pSalI2CMngtAdpt = &SalI2C3MngtAdpt;
            pSalI2CMngtAdpt->pSalHndPriv    = &SalI2C3HndPriv;
            pSalI2CMngtAdpt->pHalInitDat    = &HalI2C3InitData;
            pSalI2CMngtAdpt->pHalOp         = &HalI2COpSAL;
            pSalI2CMngtAdpt->pIrqHnd        = &I2C3IrqHandleDat;
            pSalI2CMngtAdpt->pHalTxGdmaAdp  = &HalI2C3TxGdmaAdpt;
            pSalI2CMngtAdpt->pHalRxGdmaAdp  = &HalI2C3RxGdmaAdpt;
            pSalI2CMngtAdpt->pHalGdmaOp     = &HalI2C3GdmaOp;
            pSalI2CMngtAdpt->pIrqTxGdmaHnd  = &I2C3TxGdmaIrqHandleDat;
            pSalI2CMngtAdpt->pIrqRxGdmaHnd  = &I2C3RxGdmaIrqHandleDat;
            pSalI2CMngtAdpt->pUserCB        = &SalI2C3UserCB;
            pSalI2CMngtAdpt->pDMAConf       = &SalI2C3DmaUserDef;
            pSalI2CUserCBAdpt               = (PSAL_I2C_USERCB_ADPT)&SalI2C3UserCBAdpt;            
            break;
        }
        
        default:
            break;
    }
#endif

    /*To assign user callback pointers*/
    pSalI2CMngtAdpt->pUserCB->pTXCB     = pSalI2CUserCBAdpt;
    pSalI2CMngtAdpt->pUserCB->pTXCCB    = (pSalI2CUserCBAdpt+1);
    pSalI2CMngtAdpt->pUserCB->pRXCB     = (pSalI2CUserCBAdpt+2);
    pSalI2CMngtAdpt->pUserCB->pRXCCB    = (pSalI2CUserCBAdpt+3);
    pSalI2CMngtAdpt->pUserCB->pRDREQCB  = (pSalI2CUserCBAdpt+4);
    pSalI2CMngtAdpt->pUserCB->pERRCB    = (pSalI2CUserCBAdpt+5);
    pSalI2CMngtAdpt->pUserCB->pDMATXCB  = (pSalI2CUserCBAdpt+6);
    pSalI2CMngtAdpt->pUserCB->pDMATXCCB = (pSalI2CUserCBAdpt+7);
    pSalI2CMngtAdpt->pUserCB->pDMARXCB  = (pSalI2CUserCBAdpt+8);
    pSalI2CMngtAdpt->pUserCB->pDMARXCCB = (pSalI2CUserCBAdpt+9);
    pSalI2CMngtAdpt->pUserCB->pGENCALLCB= (pSalI2CUserCBAdpt+10);
    
    /*To assign the rest pointers*/
    pSalI2CMngtAdpt->MstRDCmdCnt    = 0;
    pSalI2CMngtAdpt->InnerTimeOut   = 2000; // inner time-out count, 2000 ms
    pSalI2CMngtAdpt->pSalHndPriv->ppSalI2CHnd = (void**)&(pSalI2CMngtAdpt->pSalHndPriv);

    /* To assign the default (ROM) HAL OP initialization function */
#if  defined(CONFIG_CHIP_A_CUT) || defined(CONFIG_CHIP_B_CUT) || defined(CONFIG_CHIP_C_CUT)
    pSalI2CMngtAdpt->pHalOpInit     = HalI2COpInit_Patch;
#elif defined(CONFIG_CHIP_E_CUT)
    // TODO: E-Cut
    pSalI2CMngtAdpt->pHalOpInit     = HalI2COpInit_V04;
#endif

    /* To assign the default (ROM) HAL GDMA OP initialization function */
    pSalI2CMngtAdpt->pHalGdmaOpInit = HalGdmaOpInit;

    /* To assign the default (ROM) SAL interrupt function */
#if defined(CONFIG_CHIP_A_CUT) || defined(CONFIG_CHIP_B_CUT) || defined(CONFIG_CHIP_C_CUT)
    pSalI2CMngtAdpt->pSalIrqFunc    = I2CISRHandle_Patch;
#elif defined(CONFIG_CHIP_E_CUT)
    pSalI2CMngtAdpt->pSalIrqFunc    = I2CISRHandle_V04;
#endif

    /* To assign the default (ROM) SAL DMA TX interrupt function */
    pSalI2CMngtAdpt->pSalDMATxIrqFunc   = I2CTXGDMAISRHandle;

    /* To assign the default (ROM) SAL DMA RX interrupt function */
    pSalI2CMngtAdpt->pSalDMARxIrqFunc   = I2CRXGDMAISRHandle;
    
    return pSalI2CMngtAdpt;
}

//---------------------------------------------------------------------------------------------------
//Function Name:
//		RtkI2CFreeMngtAdpt
//
// Description:
//		Free all the previous allocated memory space.
//
// Arguments:
//		[in] PSAL_I2C_MNGT_ADPT  pSalI2CMngtAdpt -
//			I2C SAL management adapter pointer
//         
//
// Return:
//		The status of the enable process.
//          _EXIT_SUCCESS if the RtkI2CFreeMngtAdpt succeeded.
//          _EXIT_FAILURE if the RtkI2CFreeMngtAdpt failed.
//
// Note:
//		NA
//
// See Also:
//		NA
//
// Author:
// 		By Jason Deng, 2014-04-02.
//
//---------------------------------------------------------------------------------------------------
HAL_Status
RtkI2CFreeMngtAdpt(
    IN  PSAL_I2C_MNGT_ADPT  pSalI2CMngtAdpt
){
#ifndef I2C_STATIC_ALLOC
    RtlMfree((u8 *)pSalI2CMngtAdpt->pUserCB->pTXCB, (sizeof(SAL_I2C_USERCB_ADPT)*SAL_USER_CB_NUM));
    RtlMfree((u8 *)pSalI2CMngtAdpt->pDMAConf, (sizeof(SAL_I2C_DMA_USER_DEF)));
    RtlMfree((u8 *)pSalI2CMngtAdpt->pIrqRxGdmaHnd, (sizeof(IRQ_HANDLE)));
    RtlMfree((u8 *)pSalI2CMngtAdpt->pIrqTxGdmaHnd, (sizeof(IRQ_HANDLE)));
    RtlMfree((u8 *)pSalI2CMngtAdpt->pHalGdmaOp, (sizeof(HAL_GDMA_OP)));
    RtlMfree((u8 *)pSalI2CMngtAdpt->pHalRxGdmaAdp, (sizeof(HAL_GDMA_ADAPTER)));
    RtlMfree((u8 *)pSalI2CMngtAdpt->pHalTxGdmaAdp, (sizeof(HAL_GDMA_ADAPTER)));
    RtlMfree((u8 *)pSalI2CMngtAdpt->pUserCB, sizeof(SAL_I2C_USER_CB));
    RtlMfree((u8 *)pSalI2CMngtAdpt->pIrqHnd, sizeof(IRQ_HANDLE));
    RtlMfree((u8 *)pSalI2CMngtAdpt->pHalOp, sizeof(HAL_I2C_OP));
    RtlMfree((u8 *)pSalI2CMngtAdpt->pHalInitDat, sizeof(HAL_I2C_INIT_DAT));
    RtlMfree((u8 *)pSalI2CMngtAdpt->pSalHndPriv, sizeof(SAL_I2C_HND_PRIV));    
    RtlMfree((u8 *)pSalI2CMngtAdpt, sizeof(SAL_I2C_MNGT_ADPT));
#else
    ;
#endif

    return HAL_OK;
}

//---------------------------------------------------------------------------------------------------
//Function Name:
//		RtkI2CGetSalHnd
//
// Description:
//         Allocation of lower layer memory spaces will be done by invoking RtkI2CGetMngtAdpt
//         in this function and return a SAL_I2C_HND pointer to upper layer.
//         According to the given I2C index, RtkI2CGetMngtAdpt will allocate all the memory
//         space such as SAL_I2C_HND, HAL_I2C_INIT_DAT, SAL_I2C_USER_CB etc.
//         
//
// Arguments:
//		[in] u8 I2CIdx -
//			I2C Index
//
// Return:
//		PSAL_I2C_HND
//               A pointer to SAL_I2C_HND which is allocated in the lower layer.
// Note:
//		NA
//
// See Also:
//		NA
//
// Author:
// 		By Jason Deng, 2014-04-03.
//
//----------------------------------------------------------------------------------------------------
PSAL_I2C_HND
RtkI2CGetSalHnd(
    IN  u8  I2CIdx
){
    PSAL_I2C_MNGT_ADPT  pSalI2CMngtAdpt = NULL;
    PSAL_I2C_HND        pSalI2CHND      = NULL;

    /* Check the user define setting and the given index */
    if (RtkI2CIdxChk(I2CIdx)) {
        return (PSAL_I2C_HND)NULL;
    }

