alibaba/AliOS-Things/platform/mcu/rtl8710bn/sdk/component/soc/realtek/8195a/fwlib/src/hal_i2c.c
    /* Invoke RtkI2CGetMngtAdpt to get the I2C SAL management adapter pointer */
    pSalI2CMngtAdpt = RtkI2CGetMngtAdpt(I2CIdx);

    /* Assign the private SAL handle to public SAL handle */
    pSalI2CHND      = &(pSalI2CMngtAdpt->pSalHndPriv->SalI2CHndPriv);

    /* Assign the internal HAL initial data pointer to the SAL handle */
    pSalI2CHND->pInitDat    = pSalI2CMngtAdpt->pHalInitDat;

    /* Assign the internal user callback pointer to the SAL handle */
    pSalI2CHND->pUserCB     = pSalI2CMngtAdpt->pUserCB;

    /* Assign the internal user define DMA configuration to the SAL handle */
    pSalI2CHND->pDMAConf    = pSalI2CMngtAdpt->pDMAConf;
    
    return &(pSalI2CMngtAdpt->pSalHndPriv->SalI2CHndPriv);
}


//---------------------------------------------------------------------------------------------------
//Function Name:
//		RtkI2CFreeSalHnd
//
// Description:
//         Based on the given pSalI2CHND, the top layer management adapter pointer could
//         be reversely parsed. And free memory space is done by RtkI2CFreeMngtAdpt.
//         
//
// Arguments:
//		[in] PSAL_I2C_HND    pSalI2CHND -
//			SAL I2C handle
//
// Return:
//		The status of the free SAL memory space process.
//          _EXIT_SUCCESS if the RtkI2CFreeSalHnd succeeded.
//          _EXIT_FAILURE if the RtkI2CFreeSalHnd failed.
//
// Note:
//		NA
//
// See Also:
//		NA
//
// Author:
// 		By Jason Deng, 2014-04-03.
//
//----------------------------------------------------------------------------------------------------
HAL_Status
RtkI2CFreeSalHnd(
    IN  PSAL_I2C_HND    pSalI2CHND
){
    PSAL_I2C_MNGT_ADPT  pSalI2CMngtAdpt     = NULL;
    PSAL_I2C_HND_PRIV   pSalI2CHNDPriv      = NULL;

    /* To get the SAL_I2C_MNGT_ADPT pointer */
    pSalI2CHNDPriv  = CONTAINER_OF(pSalI2CHND, SAL_I2C_HND_PRIV, SalI2CHndPriv);
    pSalI2CMngtAdpt = CONTAINER_OF(pSalI2CHNDPriv->ppSalI2CHnd, SAL_I2C_MNGT_ADPT, pSalHndPriv);

    /* Invoke RtkI2CFreeMngtAdpt to free all the lower layer memory space */
    return (RtkI2CFreeMngtAdpt(pSalI2CMngtAdpt));
}

#endif  // end of "#ifndef CONFIG_MBED_ENABLED"

//---------------------------------------------------------------------------------------------------
//Function Name:
//		RtkSalI2CSts
//
// Description:
//		Get i2c status
//
// Arguments:
//         A SAL operation adapter pointer
//
// Return:
//		NA
//
// Note:
//		NA
//
// See Also:
//		NA
//
// Author:
// 		By Jason Deng, 2014-04-03.
//
//---------------------------------------------------------------------------------------------------
u32 
RtkSalI2CSts(
    IN  VOID *Data
){
    PSAL_I2C_HND        pSalI2CHND          = (PSAL_I2C_HND) Data;
    PSAL_I2C_HND_PRIV   pSalI2CHNDPriv      = NULL;
    PSAL_I2C_MNGT_ADPT  pSalI2CMngtAdpt     = NULL;
    PHAL_I2C_INIT_DAT   pHalI2CInitDat      = NULL;
    PHAL_I2C_OP         pHalI2COP           = NULL;
    u32 I2CLocalTemp;
    
    
    /* To Get the SAL_I2C_MNGT_ADPT Pointer */
    pSalI2CHNDPriv  = CONTAINER_OF(pSalI2CHND, SAL_I2C_HND_PRIV, SalI2CHndPriv);
    pSalI2CMngtAdpt = CONTAINER_OF(pSalI2CHNDPriv->ppSalI2CHnd, SAL_I2C_MNGT_ADPT, pSalHndPriv);
    
    pHalI2CInitDat  = pSalI2CMngtAdpt->pHalInitDat;
    pHalI2COP       = pSalI2CMngtAdpt->pHalOp;

    I2CLocalTemp    = pHalI2COP->HalI2CReadReg(pHalI2CInitDat, REG_DW_I2C_IC_RAW_INTR_STAT);

    if (I2CLocalTemp & BIT_IC_RAW_INTR_STAT_GEN_CALL) {
        return 2;
    }
    else if (I2CLocalTemp & BIT_IC_RAW_INTR_STAT_RD_REQ) {
        return 1;
    }

    I2CLocalTemp    = pHalI2COP->HalI2CReadReg(pHalI2CInitDat, REG_DW_I2C_IC_STATUS);

    if (I2CLocalTemp & BIT_IC_STATUS_RFNE) {
        return 3;
    }

    return 0;
}
